[
  {
    "cis_id": "5.3",
    "title": "Ensure 'Computer Browser (Browser)' is set to 'Disabled'\nor 'Not Installed'",
    "profile": "L1",
    "description": "Maintains an updated list of computers on the network and supplies this list to\ncomputers designated as browsers.\nThe recommended state for this setting is: Disabled or Not Installed.\nNote: In Windows 8.1 and Windows 10, this service is bundled with the SMB 1.0/CIFS\nFile Sharing Support optional feature. As a result, removing that feature (highly\nrecommended unless backward compatibility is needed to XP/2003 and older Windows\nOSes - see Stop using SMB1 | Storage at Microsoft) will also remediate this\nrecommendation. The feature is not installed by default starting with Windows 10\nR1709.",
    "rationale": "This is a legacy service - its sole purpose is to maintain a list of computers and their\nnetwork shares in the environment (i.e. \"Network Neighborhood\"). If enabled, it\ngenerates a lot of unnecessary traffic, including \"elections\" to see who gets to be the\n\"master browser\". This noisy traffic could also aid malicious attackers in discovering\nonline machines, because the service also allows anyone to \"browse\" for shared\nresources without any authentication. This service used to be running by default in older\nWindows versions (e.g. Windows XP), but today it only remains for backward\ncompatibility for very old software that requires it.",
    "impact": "The list of computers and their shares on the network will not be updated or maintained.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4 or that the key does not exist.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\Browser:Start\nPage 288",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command or\nensure the service is not installed.\nSet-Service -Name Browser -StartupType Disabled",
    "default_value": "Windows 7: Manual\nWindows 8.0 through Windows 10 R1703: Manual (Trigger Start)\nWindows 10 R1709 or newer: Not Installed (Manual (Trigger Start) when installed)\nReferences:\n1. https://blogs.technet.microsoft.com/filecab/2016/09/16/stop-using-smb1/\n2. GRID: MS-00000130\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 289",
    "page_number": 289
  }
]