[
  {
    "cis_id": "18.10.10.1.7",
    "title": "Ensure 'Configure use of hardware-based\nencryption for fixed data drives' is set to 'Disabled'",
    "profile": "BL",
    "description": "This policy setting allows you to manage BitLocker's use of hardware-based encryption\non fixed data drives and specify which encryption algorithms it can use with hardware-\nbased encryption. Using hardware-based encryption can improve performance of drive\noperations that involve frequent reading or writing of data to the drive.\nYou can specify additional options that control whether BitLocker software-based\nencryption is used instead of hardware-based encryption on computers that do not\nsupport hardware-based encryption and whether you want to restrict the encryption\nalgorithms and cipher suites used with hardware-based encryption.\nThe recommended state for this setting is: Disabled.",
    "rationale": "From a security perspective hardware-based encryption may introduce vulnerabilities in\nthe hardware encryption of certain self-encrypting drives (SEDs), if the vendor and/or\nuser has not updated the firmware to remediate the vulnerability. For more information\nvisit ADV180028 - Security Update Guide - Microsoft - Guidance for configuring\nBitLocker to enforce software encryption.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:FDVHardwareEncryption\nPage 825",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Fixed Data Drives\\Configure use of\nhardware-based encryption for fixed data drives\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 8.0 &\nServer 2012 (non-R2) Administrative Templates (or newer).",
    "default_value": "BitLocker will use software-based encryption irrespective of hardware-based encryption\navailability.\nReferences:\n1. https://msrc.microsoft.com/update-guide/en-US/vulnerability/ADV180028\n2. GRID: MS-00000388\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive\nof all mobile devices.\nPage 826",
    "page_number": 826
  },
  {
    "cis_id": "18.10.10.1.8",
    "title": "Ensure 'Configure use of passwords for fixed\ndata drives' is set to 'Disabled'",
    "profile": "BL",
    "description": "This policy setting specifies whether a password is required to unlock BitLocker-\nprotected fixed data drives.\nNote: This setting is enforced when turning on BitLocker, not when unlocking a volume.\nBitLocker will allow unlocking a drive with any of the protectors available on the drive.\nThe recommended state for this setting is: Disabled.",
    "rationale": "Using a dictionary-style attack, passwords can be guessed or discovered by repeatedly\nattempting to unlock a drive. Since this type of BitLocker password does include anti-\ndictionary attack protections provided by a TPM, for example, there is no mechanism to\nslow down rapid brute-force attacks against them.",
    "impact": "The password option will not be available when configuring BitLocker for fixed drives.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:FDVPassphrase",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Fixed Data Drives\\Configure use of\npasswords for fixed data drives\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).\nPage 827",
    "default_value": "Passwords are supported, without complexity requirements and with an 8 character\nminimum.\nReferences:\n1. GRID: MS-00000389\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive of all\nmobile devices.\nPage 828",
    "page_number": 828
  },
  {
    "cis_id": "18.10.10.1.9",
    "title": "Ensure 'Configure use of smart cards on fixed\ndata drives' is set to 'Enabled'",
    "profile": "BL",
    "description": "This policy setting allows you to specify whether smart cards can be used to\nauthenticate user access to the BitLocker-protected fixed data drives on a computer.\nSmart cards can be used to authenticate user access to the drive. You can require\nsmart card authentication by selecting the \"Require use of smart cards on fixed data\ndrives\" check box.\nNote: This setting is enforced when turning on BitLocker, not when unlocking a drive.\nBitLocker will allow unlocking a drive with any of the protectors available on the drive.\nThe recommended state for this setting is: Enabled.",
    "rationale": "A drive can be compromised by guessing or finding the authentication information used\nto access the drive. For example, a password could be guessed, or a drive set to\nautomatically unlock could be lost or stolen with the computer it automatically unlocks\nwith.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:FDVAllowUserCert\nPage 829",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Fixed Data Drives\\Configure use of\nsmart cards on fixed data drives\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Enabled. (Users are allowed to use smart cards to authenticate their access to\nBitLocker-protected fixed data drives.)\nReferences:\n1. GRID: MS-00000390\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n16.3 Require Multi-factor Authentication\nv7 ● ●\nRequire multi-factor authentication for all user accounts, on all systems,\nwhether managed onsite or by a third-party provider.\nPage 830",
    "page_number": 830
  },
  {
    "cis_id": "18.10.10.1.10",
    "title": "Ensure 'Configure use of smart cards on fixed\ndata drives: Require use of smart cards on fixed data drives' is set\nto 'Enabled: True'",
    "profile": "BL",
    "description": "This policy setting allows you to specify whether smart cards must be used to\nauthenticate user access to the BitLocker-protected fixed data drives on a computer.\nSmart cards can be used to authenticate user access to the drive. You can require a\nsmart card authentication by selecting the \"Require use of smart cards on fixed data\ndrives\" check box.\nNote: This setting is enforced when turning on BitLocker, not when unlocking a drive.\nBitLocker will allow unlocking a drive with any of the protectors available on the drive.\nThe recommended state for this setting is: Enabled: True (checked).",
    "rationale": "A drive can be compromised by guessing or finding the authentication information used\nto access the drive. For example, a password could be guessed, or a drive set to\nautomatically unlock could be lost or stolen with the computer it automatically unlocks\nwith.",
    "impact": "Smart cards will be required to authenticate user access to fixed data drives. Use of\nsmart cards requires PKI infrastructure. Users will need to authenticate with the smart\ncard to unlock the fixed data drive every time they restart the computer.\nPage 831",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:FDVEnforceUserCert",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled: True (checked):\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Fixed Data Drives\\Configure use of\nsmart cards on fixed data drives: Require use of smart cards on fixed data\ndrives\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Enabled: False (unchecked). (Users are allowed to use smart cards to authenticate their\naccess to BitLocker-protected fixed data drives, but it is not required.)\nReferences:\n1. GRID: MS-00000391\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n16.3 Require Multi-factor Authentication\nv7 ● ●\nRequire multi-factor authentication for all user accounts, on all systems,\nwhether managed onsite or by a third-party provider.\nPage 832",
    "page_number": 832
  },
  {
    "cis_id": "18.10.10.2.1",
    "title": "Ensure 'Allow enhanced PINs for startup' is set\nto 'Enabled'",
    "profile": "BL",
    "description": "This policy setting allows you to configure whether or not enhanced startup PINs are\nused with BitLocker.\nEnhanced startup PINs permit the use of characters including uppercase and lowercase\nletters, symbols, numbers, and spaces. This policy setting is applied when you turn on\nBitLocker.\nThe recommended state for this setting is: Enabled.",
    "rationale": "A numeric-only PIN provides less entropy than a PIN that is alpha-numeric. When not\nusing enhanced PIN for startup, BitLocker requires the use of the function keys [F1-F10]\nfor PIN entry since the PIN is entered in the pre-OS environment before localization\nsupport is available. This limits each PIN digit to one of ten possibilities. The TPM has\nan anti-hammering feature that includes a mechanism to exponentially increase the\ndelay for PIN retry attempts; however, an attacker is able to more effectively mount a\nbrute force attack using a domain of 10 digits of the function keys.",
    "impact": "All new BitLocker startup PINs set will be enhanced PINs.\nNote: Not all computers enable full keyboard support in the Pre-OS environment. Some\nkeys may not be available. It is recommended this functionality be tested using the\ncomputers in your environment prior to it being deployed.\nPage 834",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:UseEnhancedPin",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Allow enhanced\nPINs for startup\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Disabled. (Enhanced PINs will not be used.)\nReferences:\n1. GRID: MS-00000570\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n16.3 Require Multi-factor Authentication\nv7 ● ●\nRequire multi-factor authentication for all user accounts, on all systems,\nwhether managed onsite or by a third-party provider.\nPage 835",
    "page_number": 835
  },
  {
    "cis_id": "18.10.10.2.2",
    "title": "Ensure 'Allow Secure Boot for integrity\nvalidation' is set to 'Enabled'",
    "profile": "BL",
    "description": "This policy setting allows you to configure whether Secure Boot will be allowed as the\nplatform integrity provider for BitLocker operating system drives.\nSecure Boot ensures that the PC's pre-boot environment only loads firmware that is\ndigitally signed by authorized software publishers. Secure Boot also provides more\nflexibility for managing pre-boot configuration than legacy BitLocker integrity checks.\nSecure Boot requires a system that meets the UEFI 2.3.1 Specifications for Class 2 and\nClass 3 computers.\nWhen this policy is enabled and the hardware is capable of using Secure Boot for\nBitLocker scenarios, the \"Use enhanced Boot Configuration Data validation profile\"\ngroup policy setting is ignored and Secure Boot verifies BCD settings according to the\nSecure Boot policy setting, which is configured separately from BitLocker.\nNote: If the group policy setting \"Configure TPM platform validation profile for native\nUEFI firmware configurations\" is enabled and has PCR 7 omitted, BitLocker will be\nprevented from using Secure Boot for platform or Boot Configuration Data (BCD)\nintegrity validation.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Secure Boot ensures that only firmware digitally signed by authorized software\npublishers is loaded during computer startup, which reduces the risk of rootkits and\nother types of malware from gaining control of the system. It also helps provide\nprotection against malicious users booting from an alternate operating system.",
    "impact": "None - this is the default behavior.\nPage 836",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:OSAllowSecureBootForIntegrity",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Allow Secure\nBoot for integrity validation\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 8.0 &\nServer 2012 (non-R2) Administrative Templates (or newer).",
    "default_value": "Enabled. (BitLocker will use Secure Boot for platform integrity if the platform is capable\nof Secure Boot-based integrity validation.)\nReferences:\n1. GRID: MS-00000392\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n10.5 Enable Anti-Exploitation Features\nv8 Enable anti-exploitation features on enterprise assets and software, where ● ●\npossible, such as Microsoft® Data Execution Prevention (DEP), Windows®\nDefender Exploit Guard (WDEG), or Apple® System Integrity Protection (SIP) and\nGatekeeper™.\nPage 837",
    "page_number": 837
  },
  {
    "cis_id": "18.10.10.2.3",
    "title": "Ensure 'Choose how BitLocker-protected\noperating system drives can be recovered' is set to 'Enabled'",
    "profile": "BL",
    "description": "This policy setting allows you to control how BitLocker-protected operating system\ndrives are recovered in the absence of the required startup key information. This policy\nsetting is applied when you turn on BitLocker.\nThe \"Allow certificate-based data recovery agent\" check box is used to specify whether\na Data Recovery Agent can be used with BitLocker-protected operating system drives.\nBefore a Data Recovery Agent can be used it must be added from the Public Key\nPolicies item in either the Group Policy Management Console or the Local Group Policy\nEditor. Consult the BitLocker Drive Encryption Deployment Guide on Microsoft TechNet\nfor more information about adding Data Recovery Agents.\nIn \"Configure user storage of BitLocker recovery information\" select whether users are\nallowed, required, or not allowed to generate a 48-digit recovery password or a 256-bit\nrecovery key.\nSelect \"Omit recovery options from the BitLocker setup wizard\" to prevent users from\nspecifying recovery options when they enable BitLocker on a drive. This means that you\nwill not be able to specify which recovery option to use when you enable BitLocker,\ninstead BitLocker recovery options for the drive are determined by the policy setting.\nIn \"Save BitLocker recovery information to Active Directory Domain Services\", choose\nwhich BitLocker recovery information to store in AD DS for operating system drives. If\nyou select \"Backup recovery password and key package\", both the BitLocker recovery\npassword and key package are stored in AD DS. Storing the key package supports\nrecovering data from a drive that has been physically corrupted. If you select \"Backup\nrecovery password only\", only the recovery password is stored in AD DS.\nSelect the \"Do not enable BitLocker until recovery information is stored in AD DS for\noperating system drives\" check box if you want to prevent users from enabling BitLocker\nunless the computer is connected to the domain and the backup of BitLocker recovery\ninformation to AD DS succeeds.\nNote: If the \"Do not enable BitLocker until recovery information is stored in AD DS for\noperating system drives\" check box is selected, a recovery password is automatically\ngenerated.\nPage 838\nThe recommended state for this setting is: Enabled.",
    "rationale": "Should a user lose their primary means for accessing an encrypted OS volume, or\nshould the system not pass its boot time integrity checks, the system will go into\nrecovery mode. If the recovery key has not been backed up to Active Directory, the user\nwould need to have saved the recovery key to another location such as a USB flash\ndrive, or have printed the recovery password, and now have access to one of those in\norder to recovery the system. If the user is unable to produce the recovery key, then the\nuser will be denied access to the encrypted volume and subsequently any data that is\nstored there.",
    "impact": "Users will need to be domain connected to turn on BitLocker. This policy is not FIPS\ncomplaint.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:OSRecovery",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Choose how\nBitLocker-protected operating system drives can be recovered\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Disabled. (The default recovery options are supported for BitLocker recovery - a DRA is\nallowed, and the recovery options can be specified by the user including the recovery\npassword and recovery key, and recovery information is not backed up to AD DS.)\nReferences:\n1. GRID: MS-00000393\nPage 839\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.6 Encrypt Data on End-User Devices\nv8 Encrypt data on end-user devices containing sensitive data. Example ● ● ●\nimplementations can include: Windows BitLocker®, Apple FileVault®, Linux®\ndm-crypt.\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive of\nall mobile devices.\nPage 840",
    "page_number": 839
  },
  {
    "cis_id": "18.10.10.2.4",
    "title": "Ensure 'Choose how BitLocker-protected\noperating system drives can be recovered: Allow data recovery\nagent' is set to 'Enabled: False'",
    "profile": "BL",
    "description": "This policy setting allows you to control how BitLocker-protected operating system\ndrives are recovered in the absence of the required startup key information. This policy\nsetting is applied when you turn on BitLocker.\nThe \"Allow certificate-based data recovery agent\" check box is used to specify whether\na Data Recovery Agent can be used with BitLocker-protected operating system drives.\nBefore a Data Recovery Agent can be used it must be added from the Public Key\nPolicies item in either the Group Policy Management Console or the Local Group Policy\nEditor. Consult the BitLocker Drive Encryption Deployment Guide on Microsoft TechNet\nfor more information about adding Data Recovery Agents.\nThe recommended state for this setting is: Enabled: False (unchecked).",
    "rationale": "Should a user lose their primary means for accessing an encrypted OS volume, or\nshould the system not pass its boot time integrity checks, the system will go into\nrecovery mode. If the recovery key has not been backed up to Active Directory, the user\nwould need to have saved the recovery key to another location such as a USB flash\ndrive, or have printed the recovery password, and now have access to one of those in\norder to recovery the system. If the user is unable to produce the recovery key, then the\nuser will be denied access to the encrypted volume and subsequently any data that is\nstored there.",
    "impact": "A Data Recovery Agent will not be permitted for the operating system drive. Users will\nneed to be domain connected to turn on BitLocker. This policy is not FIPS complaint.\nPage 841",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:OSManageDRA",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled: False (unchecked):\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Choose how\nBitLocker-protected operating system drives can be recovered: Allow data\nrecovery agent\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Enabled: True. (A DRA is allowed.)\nReferences:\n1. GRID: MS-00000394\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.6 Encrypt Data on End-User Devices\nv8 Encrypt data on end-user devices containing sensitive data. Example ● ● ●\nimplementations can include: Windows BitLocker®, Apple FileVault®, Linux®\ndm-crypt.\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive of\nall mobile devices.\nPage 842",
    "page_number": 842
  },
  {
    "cis_id": "18.10.10.2.5",
    "title": "Ensure 'Choose how BitLocker-protected\noperating system drives can be recovered: Recovery Password' is\nset to 'Enabled: Require 48-digit recovery password'",
    "profile": "BL",
    "description": "This policy setting allows you to control how BitLocker-protected operating system\ndrives are recovered in the absence of the required startup key information. This policy\nsetting is applied when you turn on BitLocker.\nIn \"Configure user storage of BitLocker recovery information\" select whether users are\nallowed, required, or not allowed to generate a 48-digit recovery password or a 256-bit\nrecovery key.\nThe recommended state for this setting is: Enabled: Require 48-digit recovery\npassword.",
    "rationale": "Should a user lose their primary means for accessing an encrypted OS volume, or\nshould the system not pass its boot time integrity checks, the system will go into\nrecovery mode. If the recovery key has not been backed up to Active Directory, the user\nwould need to have saved the recovery key to another location such as a USB flash\ndrive, or have printed the recovery password, and now have access to one of those in\norder to recovery the system. If the user is unable to produce the recovery key, then the\nuser will be denied access to the encrypted volume and subsequently any data that is\nstored there.",
    "impact": "A 48-digit recovery password will be required for the operating system drive. Users will\nneed to be domain connected to turn on BitLocker. This policy is not FIPS complaint.\nPage 843",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:OSRecoveryPassword",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled: Require 48-digit recovery password:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Choose how\nBitLocker-protected operating system drives can be recovered: Recovery\nPassword\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Recovery options are specified by the user.\nReferences:\n1. GRID: MS-00000395\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.6 Encrypt Data on End-User Devices\nv8 Encrypt data on end-user devices containing sensitive data. Example ● ● ●\nimplementations can include: Windows BitLocker®, Apple FileVault®, Linux®\ndm-crypt.\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive of\nall mobile devices.\nPage 844",
    "page_number": 844
  },
  {
    "cis_id": "18.10.10.2.6",
    "title": "Ensure 'Choose how BitLocker-protected\noperating system drives can be recovered: Recovery Key' is set\nto 'Enabled: Do not allow 256-bit recovery key'",
    "profile": "BL",
    "description": "This policy setting allows you to control how BitLocker-protected operating system\ndrives are recovered in the absence of the required startup key information. This policy\nsetting is applied when you turn on BitLocker.\nIn \"Configure user storage of BitLocker recovery information\" select whether users are\nallowed, required, or not allowed to generate a 48-digit recovery password or a 256-bit\nrecovery key.\nThe recommended state for this setting is: Enabled: Do not allow 256-bit\nrecovery key.",
    "rationale": "Should a user lose their primary means for accessing an encrypted OS volume, or\nshould the system not pass its boot time integrity checks, the system will go into\nrecovery mode. If the recovery key has not been backed up to Active Directory, the user\nwould need to have saved the recovery key to another location such as a USB flash\ndrive, or have printed the recovery password, and now have access to one of those in\norder to recovery the system. If the user is unable to produce the recovery key, then the\nuser will be denied access to the encrypted volume and subsequently any data that is\nstored there.",
    "impact": "A 256-bit recovery key will not be permitted for the operating system drive. Users will\nneed to be domain connected to turn on BitLocker. This policy is not FIPS complaint.\nPage 845",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\FVE:OSRecoveryKey",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled: Do not allow 256-bit recovery key:\nComputer Configuration\\Policies\\Administrative Templates\\Windows\nComponents\\BitLocker Drive Encryption\\Operating System Drives\\Choose how\nBitLocker-protected operating system drives can be recovered: Recovery Key\nNote: This Group Policy path is provided by the Group Policy template\nVolumeEncryption.admx/adml that is included with the Microsoft Windows 7 & Server\n2008 R2 Administrative Templates (or newer).",
    "default_value": "Recovery options are specified by the user.\nReferences:\n1. GRID: MS-00000396\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.6 Encrypt Data on End-User Devices\nv8 Encrypt data on end-user devices containing sensitive data. Example ● ● ●\nimplementations can include: Windows BitLocker®, Apple FileVault®, Linux®\ndm-crypt.\n13.6 Encrypt the Hard Drive of All Mobile Devices.\nv7 ● ● ●\nUtilize approved whole disk encryption software to encrypt the hard drive of\nall mobile devices.\nPage 846",
    "page_number": 846
  }
]