[
  {
    "cis_id": "5.7",
    "title": "Ensure 'IIS Admin Service (IISADMIN)' is set to 'Disabled'\nor 'Not Installed'",
    "profile": "L1",
    "description": "Enables the server to administer the IIS metabase. The IIS metabase stores\nconfiguration for the SMTP and FTP services.\nThe recommended state for this setting is: Disabled or Not Installed.\nNote: This service is not installed by default. It is supplied with Windows, but is installed\nby enabling an optional Windows feature (Internet Information Services).\nNote #2: An organization may choose to selectively grant exceptions to web developers\nto allow IIS (or another web server) on their workstation, in order for them to locally test\n& develop web pages. However, the organization should track those machines and\nensure the security controls and mitigations are kept up to date, to reduce risk of\ncompromise.",
    "rationale": "Hosting a website from a workstation is an increased security risk, as the attack surface\nof that workstation is then greatly increased. If proper security mitigations are not\nfollowed, the chance of successful attack increases significantly.\nNote: This security concern applies to any web server application installed on a\nworkstation, not just IIS.",
    "impact": "IIS will not function, including Web, SMTP or FTP services.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4 or that the key does not exist.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\IISADMIN:Start\nPage 296",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command or\nensure the service is not installed.\nSet-Service -Name IISADMIN -StartupType Disabled",
    "default_value": "Not Installed (Automatic when installed)\nReferences:\n1. GRID: MS-00000133\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 297",
    "page_number": 297
  }
]