[
  {
    "cis_id": "5.5",
    "title": "Ensure 'GameInput Service (GameInputSvc)' is set to\n'Disabled'",
    "profile": "L2",
    "description": "This service enables the use of keyboards, mice, gamepads, and other input devices to\nbe used with the GameInput API.\nThe recommended state for this setting is: Disabled.\nNote: GameInput service runs as LocalSystem in its own process of GameInputSvc.exe\nand doesn't share its process with other services.",
    "rationale": "GameInput API pipes input from keyboards, mice, gamepads, and other game\ncontrollers via Direct Memory Access (DMA) to decrease latency for gaming\nperformance. This DMA use increases the risk of input data (especially keystrokes)\nbeing captured by a malicious attacker.",
    "impact": "Input devices will not be able to utilize the GameInput API.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\GameInputSvc:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name GameInputSvc -StartupType Disabled",
    "default_value": "Windows 11 Release 24H2 or newer: Manual (Trigger Start)\nReferences:\n1. https://learn.microsoft.com/en-us/gaming/gdk/_content/gc/input/overviews/input-\noverview\n2. GRID: MS-00000607\nPage 292\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 293",
    "page_number": 293
  }
]