[
  {
    "cis_id": "2.2.1",
    "title": "Ensure 'Access Credential Manager as a trusted caller'\nis set to 'No One'",
    "profile": "L1",
    "description": "This security setting is used by Credential Manager during Backup and Restore. No\naccounts should have this user right, as it is only assigned to Winlogon. Users' saved\ncredentials might be compromised if this user right is assigned to other entities.\nThe recommended state for this setting is: No One.",
    "rationale": "If an account is given this right the user of the account may create an application that\ncalls into Credential Manager and is returned the credentials for another user.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No\nOne:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Access Credential Manager as a trusted caller",
    "default_value": "No one.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/access-credential-manager-as-a-trusted-caller\n2. GRID: MS-00000012\nPage 67\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\n4.8 Log and Alert on Changes to Administrative Group\nMembership\nv7 ● ●\nConfigure systems to issue a log entry and alert when an account is added to or\nremoved from any group assigned administrative privileges.\nPage 68",
    "page_number": 68
  },
  {
    "cis_id": "2.2.2",
    "title": "Ensure 'Access this computer from the network' is set\nto 'Administrators, Remote Desktop Users'",
    "profile": "L1",
    "description": "This policy setting allows other users on the network to connect to the computer and is\nrequired by various network protocols that include Server Message Block (SMB)-based\nprotocols, NetBIOS, Common Internet File System (CIFS), and Component Object\nModel Plus (COM+).\nThe recommended state for this setting is: Administrators, Remote Desktop Users.\nNote: If your organization is using Microsoft Defender for Identity (formerly Azure\nAdvanced Threat Protection (Azure ATP)), the (organization-named) Defender for\nIdentity Directory Service Account (DSA), will also need to be granted the same Access\nthis computer from the network User Right Assignment. For more information on\nadding the service account please see Make sure the DSA is allowed to access\ncomputers from the network in Microsoft Defender for Identity | Microsoft Docs.",
    "rationale": "Users who can connect from their computer to the network can access resources on\ntarget computers for which they have permission. For example, the Access this\ncomputer from the network user right is required for users to connect to shared\nprinters and folders. If this user right is assigned to the Everyone group, then anyone\nwill be able to read the files in those shared folders. However, this situation is unlikely\nfor new installations of Windows Server 2003 with Service Pack 1 (SP1), because the\ndefault share and NTFS permissions in Windows Server 2003 do not include the\nEveryone group. This vulnerability may have a higher level of risk for computers that\nyou upgrade from Windows NT 4.0 or Windows 2000, because the default permissions\nfor these operating systems are not as restrictive as the default permissions in Windows\nServer 2003.\nPage 69",
    "impact": "If you remove the Access this computer from the network user right on Domain\nControllers for all users, no one will be able to log on to the domain or use network\nresources. If you remove this user right on Member Servers, users will not be able to\nconnect to those servers through the network. Successful negotiation of IPsec\nconnections requires that the initiating machine has this right, therefore if using IPsec, it\nis recommended that it be assigned to the Authenticated Users group. If you have\ninstalled optional components such as ASP.NET or Internet Information Services (IIS),\nyou may need to assign this user right to additional accounts that are required by those\ncomponents. It is important to verify that authorized users are assigned this user right\nfor the computers they need to access the network.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, Remote Desktop Users:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Access this computer from the network",
    "default_value": "Administrators, Backup Operators, Everyone, Users.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/access-this-computer-from-the-network\n2. GRID: MS-00000013\nPage 70\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\n9.2 Ensure Only Approved Ports, Protocols and Services\nAre Running\nv7 ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 71",
    "page_number": 70
  },
  {
    "cis_id": "2.2.3",
    "title": "Ensure 'Act as part of the operating system' is set to\n'No One'",
    "profile": "L1",
    "description": "This policy setting allows a process to assume the identity of any user and thus gain\naccess to the resources that the user is authorized to access.\nThe recommended state for this setting is: No One.\nNote: This user right is considered a \"sensitive privilege\" for the purposes of auditing.",
    "rationale": "The Act as part of the operating system user right is extremely powerful. Anyone with\nthis user right can take complete control of the computer and erase evidence of their\nactivities.",
    "impact": "There should be little or no impact because the Act as part of the operating system\nuser right is rarely needed by any accounts other than the Local System account,\nwhich implicitly has this right.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No\nOne:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Act as part of the operating system",
    "default_value": "No one.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/act-as-part-of-the-operating-system\n2. GRID: MS-00000014\nPage 72\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 73",
    "page_number": 73
  },
  {
    "cis_id": "2.2.4",
    "title": "Ensure 'Adjust memory quotas for a process' is set to\n'Administrators, LOCAL SERVICE, NETWORK SERVICE'",
    "profile": "L1",
    "description": "This policy setting allows a user to adjust the maximum amount of memory that is\navailable to a process. The ability to adjust memory quotas is useful for system tuning,\nbut it can be abused. In the wrong hands, it could be used to launch a denial of service\n(DoS) attack.\nThe recommended state for this setting is: Administrators, LOCAL SERVICE,\nNETWORK SERVICE.",
    "rationale": "A user with the Adjust memory quotas for a process user right can reduce the\namount of memory that is available to any process, which could cause business-critical\nnetwork applications to become slow or to fail. In the wrong hands, this privilege could\nbe used to start a denial of service (DoS) attack.",
    "impact": "Organizations that have not restricted users to roles with limited privileges will find it\ndifficult to impose this countermeasure. Also, if you have installed optional components\nsuch as ASP.NET or IIS, you may need to assign the Adjust memory quotas for a\nprocess user right to additional accounts that are required by those components.\nOtherwise, this countermeasure should have no impact on most computers. If this user\nright is necessary for a user account, it can be assigned to a local computer account\ninstead of a domain account.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 74",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, LOCAL SERVICE, NETWORK SERVICE:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Adjust memory quotas for a process",
    "default_value": "Administrators, LOCAL SERVICE, NETWORK SERVICE.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/adjust-memory-quotas-for-a-process\n2. GRID: MS-00000016\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 75",
    "page_number": 75
  },
  {
    "cis_id": "2.2.5",
    "title": "Ensure 'Allow log on locally' is set to 'Administrators,\nUsers'",
    "profile": "L1",
    "description": "This policy setting determines which users can interactively log on to computers in your\nenvironment. Logons that are initiated by pressing the CTRL+ALT+DEL key sequence\non the client computer keyboard require this user right. Users who attempt to log on\nthrough Terminal Services / Remote Desktop Services or IIS also require this user right.\nThe recommended state for this setting is: Administrators, Users.\nNote: The Guest account is also assigned this user right by default. Although this\naccount is disabled by default, it's recommended that you configure this setting through\nGroup Policy. However, this user right should generally be restricted to the\nAdministrators and Users groups. Assign this user right to the Backup Operators\ngroup if your organization requires that they have this capability.",
    "rationale": "Any account with the Allow log on locally user right can log on at the console of the\ncomputer. If you do not restrict this user right to legitimate users who need to be able to\nlog on to the console of the computer, unauthorized users could download and run\nmalicious software to elevate their privileges.",
    "impact": "If you remove these default groups, you could limit the abilities of users who are\nassigned to specific administrative roles in your environment. You should confirm that\ndelegated activities will not be adversely affected by any changes that you make to the\nAllow log on locally user right.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 76",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, Users:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Allow log on locally",
    "default_value": "Administrators, Backup Operators, Guest, Users.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/allow-log-on-locally\n2. GRID: MS-00000017\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 77",
    "page_number": 77
  },
  {
    "cis_id": "2.2.6",
    "title": "Ensure 'Allow log on through Remote Desktop\nServices' is set to 'Administrators, Remote Desktop Users'",
    "profile": "L1",
    "description": "This policy setting determines which users or groups have the right to log on as a\nRemote Desktop Services client. If your organization uses Remote Assistance as part of\nits help desk strategy, create a group and assign it this user right through Group Policy.\nIf the help desk in your organization does not use Remote Assistance, assign this user\nright only to the Administrators group or use the Restricted Groups feature to ensure\nthat no user accounts are part of the Remote Desktop Users group.\nRestrict this user right to the Administrators group, and possibly the Remote\nDesktop Users group, to prevent unwanted users from gaining access to computers on\nyour network by means of the Remote Assistance feature.\nThe recommended state for this setting is: Administrators, Remote Desktop Users.\nNote: The above list is to be treated as a whitelist, which implies that the above\nprincipals need not be present for assessment of this recommendation to pass.\nNote #2: In all versions of Windows prior to Windows 7, Remote Desktop Services\nwas known as Terminal Services, so you should substitute the older term if comparing\nagainst an older OS.",
    "rationale": "Any account with the Allow log on through Remote Desktop Services user right can\nlog on to the remote console of the computer. If you do not restrict this user right to\nlegitimate users who need to log on to the console of the computer, unauthorized users\ncould download and run malicious software to elevate their privileges.",
    "impact": "Removal of the Allow log on through Remote Desktop Services user right from other\ngroups or membership changes in these default groups could limit the abilities of users\nwho perform specific administrative roles in your environment. You should confirm that\ndelegated activities will not be adversely affected.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 78",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, Remote Desktop Users:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Allow log on through Remote Desktop Services",
    "default_value": "Administrators, Remote Desktop Users.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/allow-log-on-through-remote-desktop-services\n2. GRID: MS-00000018\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\n4.3 Ensure the Use of Dedicated Administrative Accounts\nv7 Ensure that all users with administrative account access use a dedicated or ● ● ●\nsecondary account for elevated activities. This account should only be used for\nadministrative activities and not internet browsing, email, or similar activities.\nPage 79",
    "page_number": 79
  },
  {
    "cis_id": "2.2.7",
    "title": "Ensure 'Back up files and directories' is set to\n'Administrators'",
    "profile": "L1",
    "description": "This policy setting allows users to circumvent file and directory permissions to back up\nthe system. This user right is enabled only when an application (such as NTBACKUP)\nattempts to access a file or directory through the NTFS file system backup application\nprogramming interface (API). Otherwise, the assigned file and directory permissions\napply.\nThe recommended state for this setting is: Administrators.\nNote: This user right is considered a \"sensitive privilege\" for the purposes of auditing.",
    "rationale": "Users who are able to back up data from a computer could take the backup media to a\nnon-domain computer on which they have administrative privileges and restore the\ndata. They could take ownership of the files and view any unencrypted data that is\ncontained within the backup set.",
    "impact": "Changes in the membership of the groups that have the Back up files and directories\nuser right could limit the abilities of users who are assigned to specific administrative\nroles in your environment. You should confirm that authorized backup administrators\nare still able to perform backup operations.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators.\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Back up files and directories",
    "default_value": "Administrators, Backup Operators.\nPage 80\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/back-up-files-and-directories\n2. GRID: MS-00000019\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 81",
    "page_number": 81
  },
  {
    "cis_id": "2.2.8",
    "title": "Ensure 'Change the system time' is set to\n'Administrators, LOCAL SERVICE'",
    "profile": "L1",
    "description": "This policy setting determines which users and groups can change the time and date on\nthe internal clock of the computers in your environment. Users who are assigned this\nuser right can affect the appearance of event logs. When a computer's time setting is\nchanged, logged events reflect the new time, not the actual time that the events\noccurred.\nThe recommended state for this setting is: Administrators, LOCAL SERVICE.\nNote: Discrepancies between the time on the local computer and on the Domain\nControllers in your environment may cause problems for the Kerberos authentication\nprotocol, which could make it impossible for users to log on to the domain or obtain\nauthorization to access domain resources after they are logged on. Also, problems will\noccur when Group Policy is applied to client computers if the system time is not\nsynchronized with the Domain Controllers.\nPage 82",
    "rationale": "Users who can change the time on a computer could cause several problems. For\nexample, time stamps on event log entries could be made inaccurate, time stamps on\nfiles and folders that are created or modified could be incorrect, and computers that\nbelong to a domain may not be able to authenticate themselves or users who try to log\non to the domain from them. Also, because the Kerberos authentication protocol\nrequires that the requestor and authenticator have their clocks synchronized within an\nadministrator-defined skew period, an attacker who changes a computer's time may\ncause that computer to be unable to obtain or grant Kerberos tickets.\nThe risk from these types of events is mitigated on most Domain Controllers, Member\nServers, and end-user computers because the Windows Time service automatically\nsynchronizes time with Domain Controllers in the following ways:\n• All client desktop computers and Member Servers use the authenticating Domain\nController as their inbound time partner.\n• All Domain Controllers in a domain nominate the Primary Domain Controller\n(PDC) Emulator operations master as their inbound time partner.\n• All PDC Emulator operations masters follow the hierarchy of domains in the\nselection of their inbound time partner.\n• The PDC Emulator operations master at the root of the domain is authoritative for\nthe organization. Therefore it is recommended that you configure this computer\nto synchronize with a reliable external time server.\nThis vulnerability becomes much more serious if an attacker is able to change the\nsystem time and then stop the Windows Time service or reconfigure it to synchronize\nwith a time server that is not accurate.",
    "impact": "There should be no impact, because time synchronization for most organizations should\nbe fully automated for all computers that belong to the domain. Computers that do not\nbelong to the domain should be configured to synchronize with an external source.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 83",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, LOCAL SERVICE:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Change the system time",
    "default_value": "Administrators, LOCAL SERVICE.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/change-the-system-time\n2. GRID: MS-00000020\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 84",
    "page_number": 83
  },
  {
    "cis_id": "2.2.9",
    "title": "Ensure 'Change the time zone' is set to 'Administrators,\nLOCAL SERVICE, Users'",
    "profile": "L1",
    "description": "This setting determines which users can change the time zone of the computer. This\nability holds no great danger for the computer and may be useful for mobile workers.\nThe recommended state for this setting is: Administrators, LOCAL SERVICE, Users.",
    "rationale": "Changing the time zone represents little vulnerability because the system time is not\naffected. This setting merely enables users to display their preferred time zone while\nbeing synchronized with Domain Controllers in different time zones.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, LOCAL SERVICE, Users:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Change the time zone",
    "default_value": "Administrators, LOCAL SERVICE, Users.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/change-the-time-zone\n2. GRID: MS-00000021\nPage 85\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 86",
    "page_number": 86
  },
  {
    "cis_id": "2.2.10",
    "title": "Ensure 'Create a pagefile' is set to 'Administrators'",
    "profile": "L1",
    "description": "This policy setting allows users to change the size of the pagefile. By making the\npagefile extremely large or extremely small, an attacker could easily affect the\nperformance of a compromised computer.\nThe recommended state for this setting is: Administrators.",
    "rationale": "Users who can change the page file size could make it extremely small or move the file\nto a highly fragmented storage volume, which could cause reduced computer\nperformance.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Create a pagefile",
    "default_value": "Administrators.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/create-a-pagefile\n2. GRID: MS-00000022\nPage 87\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 88",
    "page_number": 88
  }
]