[
  {
    "cis_id": "5.35",
    "title": "Ensure 'Windows Remote Management (WS-\nManagement) (WinRM)' is set to 'Disabled'",
    "profile": "L2",
    "description": "Windows Remote Management (WinRM) service implements the WS-Management\nprotocol for remote management. WS-Management is a standard web services protocol\nused for remote software and hardware management. The WinRM service listens on\nthe network for WS-Management requests and processes them.\nThe recommended state for this setting is: Disabled.",
    "rationale": "Features that enable inbound network connections increase the attack surface. In a\nhigh security environment, management of secure workstations should be handled\nlocally.",
    "impact": "The ability to remotely manage the system with WinRM will be lost.\nNote: Many remote administration tools, such as System Center Configuration Manager\n(SCCM), may require the WinRM service to be operational for remote management.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WinRM:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name WinRM -StartupType Disabled",
    "default_value": "Manual\nReferences:\n1. GRID: MS-00000167\nPage 352\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 353",
    "page_number": 353
  }
]