[
  {
    "cis_id": "5.33",
    "title": "Ensure 'Windows Push Notifications System Service\n(WpnService)' is set to 'Disabled'",
    "profile": "L2",
    "description": "This service runs in session 0 and hosts the notification platform and connection\nprovider which handles the connection between the device and WNS server.\nThe recommended state for this setting is: Disabled.\nNote: In the first two releases of Windows 10 (R1507 & R1511), the display name of\nthis service was initially named Windows Push Notifications Service - but it was\nrenamed to Windows Push Notifications System Service starting with Windows 10\nR1607.",
    "rationale": "Windows Push Notification Services (WNS) is a mechanism to receive third-party\nnotifications and updates from the cloud/Internet. In a high security environment,\nexternal systems, especially those hosted outside the organization, should be prevented\nfrom having an impact on the secure workstations.",
    "impact": "Live Tiles and other features will not get live updates.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WpnService:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name WpnService -StartupType Disabled",
    "default_value": "Automatic\nReferences:\n1. GRID: MS-00000165\nPage 348\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 349",
    "page_number": 349
  }
]