[
  {
    "cis_id": "5.36",
    "title": "Ensure 'WinHTTP Web Proxy Auto-Discovery Service\n(WinHttpAutoProxySvc)' is set to 'Disabled'",
    "profile": "L2",
    "description": "WinHTTP implements the client HTTP stack and provides developers with a Win32 API\nand COM Automation component for sending HTTP requests and receiving responses.\nIn addition, WinHTTP provides support for auto-discovering a proxy configuration via its\nimplementation of the Web Proxy Auto-Discovery (WPAD) protocol.\nThe recommended state for this setting is: Disabled.\nNote: Although CIS categorizes this as a L2 recommendation, if none of the cases\nlisted in the Impact Section apply, we highly recommend disabling this service.",
    "rationale": "This service is primarily needed to support Web Proxy Auto-Discovery (WPAD), which\nis an auto-proxy discovery mechanism that could expose the computer to Man-In-The-\nMiddle (MITM) attacks. If an organization depends on HTTP proxy configuration, it is\nrecommended that other client configuration mechanisms be used instead, such as\nGroup Policy.",
    "impact": "WPAD will cease to function for automatic HTTP proxy routing, which may prevent\nInternet connectivity for workstations in organizations that currently use WPAD.\nMicrosoft also cautions that some software that uses the network stack may have a\nfunctional dependency on this service, so it is advised that you test disabling this\nservice on a representation of user workstations and applications before disabling it\nacross the entire organization.\nBeginning with Windows 10 Release 1709, Microsoft changed the WPAD service to\ntightly integrate it with all proxy activity. Disabling this service now has these additional\nimpacts:\n• The ability to set a manual (not just auto) proxy configuration.\n• Some VPN clients require the WPAD service, so disabling WPAD breaks them.\n• Some network-related applications will not work without WPAD running (e.g.\nFiddler).\nPage 354",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WinHttpAutoProxySvc:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name WinHttpAutoProxySvc -StartupType Disabled",
    "default_value": "Manual\nReferences:\n1. GRID: MS-00000573\n2. https://learn.microsoft.com/en-us/windows/win32/winhttp/winhttp-autoproxy-\nsupport\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 355",
    "page_number": 355
  }
]