[
  {
    "cis_id": "5.29",
    "title": "Ensure 'Windows Error Reporting Service (WerSvc)' is\nset to 'Disabled'",
    "profile": "L2",
    "description": "Allows errors to be reported when programs stop working or responding and allows\nexisting solutions to be delivered. Also allows logs to be generated for diagnostic and\nrepair services.\nThe recommended state for this setting is: Disabled.",
    "rationale": "If a Windows Error occurs in a secure, enterprise managed environment, the error\nshould be reported directly to IT staff for troubleshooting and remediation. There is no\nbenefit to the corporation to report these errors directly to Microsoft, and there is some\nrisk of unknowingly exposing sensitive data as part of the error.",
    "impact": "If this service is stopped, error reporting might not work correctly and results of\ndiagnostic services and repairs might not be displayed.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WerSvc:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name WerSvc -StartupType Disabled",
    "default_value": "Windows 7: Manual\nWindows 8.0 or newer: Manual (Trigger Start)\nReferences:\n1. GRID: MS-00000161\nPage 340\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 341",
    "page_number": 341
  }
]