[
  {
    "cis_id": "2.3.15.2",
    "title": "Ensure 'System objects: Strengthen default\npermissions of internal system objects (e.g. Symbolic Links)' is\nset to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines the strength of the default discretionary access control list\n(DACL) for objects. Active Directory maintains a global list of shared system resources,\nsuch as DOS device names, mutexes, and semaphores. In this way, objects can be\nlocated and shared among processes. Each type of object is created with a default\nDACL that specifies who can access the objects and what permissions are granted.\nThe recommended state for this setting is: Enabled.",
    "rationale": "This setting determines the strength of the default DACL for objects. Windows maintains\na global list of shared computer resources so that objects can be located and shared\namong processes. Each type of object is created with a default DACL that specifies who\ncan access the objects and with what permissions.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager:ProtectionMode\nPage 264",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System objects: Strengthen default permissions of\ninternal system objects (e.g. Symbolic Links)",
    "default_value": "Enabled. (The default DACL is stronger, allowing users who are not administrators to\nread shared objects but not allowing these users to modify shared objects that they did\nnot create.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-objects-strengthen-default-permissions-of-internal-system-\nobjects\n2. GRID: MS-00000119\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.1 Establish and Maintain a Secure Configuration Process\nEstablish and maintain a secure configuration process for enterprise assets\nv8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ●\nservers) and software (operating systems and applications). Review and update\ndocumentation annually, or when significant enterprise changes occur that could\nimpact this Safeguard.\n5.1 Establish Secure Configurations\nv7 ● ● ●\nMaintain documented, standard security configuration standards for all\nauthorized operating systems and software.\n2.3.16 System settings\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 265",
    "page_number": 265
  },
  {
    "cis_id": "2.3.17.1",
    "title": "Ensure 'User Account Control: Admin Approval\nMode for the Built-in Administrator account' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of Admin Approval Mode for the built-in\nAdministrator account.\nThe recommended state for this setting is: Enabled.",
    "rationale": "One of the risks that the User Account Control feature introduced with Windows Vista is\ntrying to mitigate is that of malicious software running under elevated credentials without\nthe user or administrator being aware of its activity. An attack vector for these programs\nwas to discover the password of the account named \"Administrator\" because that user\naccount was created for all installations of Windows. To address this risk, in Windows\nVista or newer, the built-in Administrator account is now disabled by default. In a default\ninstallation of a new computer, accounts with administrative control over the computer\nare initially set up in one of two ways:\n• If the computer is not joined to a domain, the first user account you create has\nthe equivalent permissions as a local administrator.\n• If the computer is joined to a domain, no local administrator accounts are\ncreated. The Enterprise or Domain Administrator must log on to the computer\nand create one if a local administrator account is warranted.\nOnce Windows is installed, the built-in Administrator account may be manually enabled,\nbut we strongly recommend that this account remain disabled.",
    "impact": "The built-in Administrator account uses Admin Approval Mode. Users that log on using\nthe local Administrator account will be prompted for consent whenever a program\nrequests an elevation in privilege, just like any other user would.\nPage 267",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:FilterAdminist\nratorToken",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Admin Approval Mode for the\nBuilt-in Administrator account",
    "default_value": "Disabled. (The built-in Administrator account runs all applications with full administrative\nprivilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-admin-approval-mode-for-the-built-in-\nadministrator-account\n2. GRID: MS-00000120\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n4.4 Use Unique Passwords\nv7 Where multi-factor authentication is not supported (such as local ● ●\nadministrator, root, or service accounts), accounts will use passwords that are\nunique to that system.\nPage 268",
    "page_number": 268
  },
  {
    "cis_id": "2.3.17.2",
    "title": "Ensure 'User Account Control: Behavior of the\nelevation prompt for administrators in Admin Approval Mode' is\nset to 'Prompt for consent on the secure desktop' or higher",
    "profile": "L1",
    "description": "This policy setting controls the behavior of the elevation prompt for administrators.\nThe recommended state for this setting is: Prompt for consent on the secure\ndesktop. Configuring this setting to Prompt for credentials on the secure\ndesktop also conforms to the benchmark.",
    "rationale": "One of the risks that the UAC feature introduced with Windows Vista is trying to mitigate\nis that of malicious software running under elevated credentials without the user or\nadministrator being aware of its activity. This setting raises awareness to the\nadministrator of elevated privilege operations and permits the administrator to prevent a\nmalicious program from elevating its privilege when the program attempts to do so.",
    "impact": "When an operation (including execution of a Windows binary) requires elevation of\nprivilege, the user is prompted on the secure desktop to select either Permit or Deny. If\nthe user selects Permit, the operation continues with the user's highest available\nprivilege.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:ConsentPromptB\nehaviorAdmin\nPage 269",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Prompt\nfor consent on the secure desktop or Prompt for credentials on the\nsecure desktop:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Behavior of the elevation\nprompt for administrators in Admin Approval Mode",
    "default_value": "Prompt for consent for non-Windows binaries. (When an operation for a non-Microsoft\napplication requires elevation of privilege, the user is prompted on the secure desktop to\nselect either Permit or Deny. If the user selects Permit, the operation continues with the\nuser's highest available privilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-behavior-of-the-elevation-prompt-for-\nadministrators-in-admin-approval-mode\n2. GRID: MS-00000121\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 270",
    "page_number": 270
  },
  {
    "cis_id": "2.3.17.3",
    "title": "Ensure 'User Account Control: Behavior of the\nelevation prompt for standard users' is set to 'Automatically deny\nelevation requests'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of the elevation prompt for standard users.\nThe recommended state for this setting is: Automatically deny elevation\nrequests.",
    "rationale": "One of the risks that the User Account Control feature introduced with Windows Vista is\ntrying to mitigate is that of malicious programs running under elevated credentials\nwithout the user or administrator being aware of their activity. This setting raises\nawareness to the user that a program requires the use of elevated privilege operations\nand requires that the user be able to supply administrative credentials in order for the\nprogram to run.",
    "impact": "When an operation requires elevation of privilege, a configurable access denied error\nmessage is displayed. An enterprise that is running desktops as standard user may\nchoose this setting to reduce help desk calls.\nNote: With this setting configured as recommended, the default error message\ndisplayed when a user attempts to perform an operation or run a program requiring\nprivilege elevation (without Administrator rights) is \"This program will not run. This\nprogram is blocked by group policy. For more information, contact your system\nadministrator.\" Some users who are not used to seeing this message may believe that\nthe operation or program they attempted to run is specifically blocked by group policy,\nas that is what the message seems to imply. This message may therefore result in user\nquestions as to why that specific operation/program is blocked, when in fact, the\nproblem is that they need to perform the operation or run the program with an\nAdministrative account (or \"Run as Administrator\" if it is already an Administrator\naccount), and they are not doing that.\nPage 271",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:ConsentPromptB\nehaviorUser",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAutomatically deny elevation requests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Behavior of the elevation\nprompt for standard users",
    "default_value": "Prompt for credentials. (When an operation requires elevation of privilege, the user is\nprompted to enter an administrative user name and password. If the user enters valid\ncredentials, the operation continues with the applicable privilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-behavior-of-the-elevation-prompt-for-\nstandard-users\n2. GRID: MS-00000122\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 272",
    "page_number": 272
  },
  {
    "cis_id": "2.3.17.4",
    "title": "Ensure 'User Account Control: Detect application\ninstallations and prompt for elevation' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of application installation detection for the\ncomputer.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Some malicious software will attempt to install itself after being given permission to run.\nFor example, malicious software with a trusted application shell. The user may have\ngiven permission for the program to run because the program is trusted, but if they are\nthen prompted for installation of an unknown component this provides another way of\ntrapping the software before it can do damage",
    "impact": "When an application installation package is detected that requires elevation of privilege,\nthe user is prompted to enter an administrative user name and password. If the user\nenters valid credentials, the operation continues with the applicable privilege.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:EnableInstalle\nrDetection\nPage 273",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Detect application\ninstallations and prompt for elevation",
    "default_value": "Disabled. (Default for enterprise. Application installation packages are not detected and\nprompted for elevation.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-detect-application-installations-and-prompt-\nfor-elevation\n2. GRID: MS-00000123\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 274",
    "page_number": 274
  },
  {
    "cis_id": "2.3.17.5",
    "title": "Ensure 'User Account Control: Only elevate\nUIAccess applications that are installed in secure locations' is set\nto 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls whether applications that request to run with a User Interface\nAccessibility (UIAccess) integrity level must reside in a secure location in the file\nsystem. Secure locations are limited to the following:\n• …\\Program Files\\, including subfolders\n• …\\Windows\\System32\\\n• …\\Program Files (x86)\\, including subfolders (for 64-bit versions of Windows)\nNote: Windows enforces a public key infrastructure (PKI) signature check on any\ninteractive application that requests to run with a UIAccess integrity level regardless of\nthe state of this security setting.\nThe recommended state for this setting is: Enabled.",
    "rationale": "UIAccess Integrity allows an application to bypass User Interface Privilege Isolation\n(UIPI) restrictions when an application is elevated in privilege from a standard user to an\nadministrator. This is required to support accessibility features such as screen readers\nthat are transmitting user interfaces to alternative forms. A process that is started with\nUIAccess rights has the following abilities:\n• To set the foreground window.\n• To drive any application window using SendInput function.\n• To use read input for all integrity levels using low-level hooks, raw input,\nGetKeyState, GetAsyncKeyState, and GetKeyboardInput.\n• To set journal hooks.\n• To uses AttachThreadInput to attach a thread to a higher integrity input queue.",
    "impact": "None - this is the default behavior.\nPage 275",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:EnableSecureUI\nAPaths",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Only elevate UIAccess\napplications that are installed in secure locations",
    "default_value": "Enabled. (If an application resides in a secure location in the file system, it runs only\nwith UIAccess integrity.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-only-elevate-uiaccess-applications-that-are-\ninstalled-in-secure-locations\n2. GRID: MS-00000124\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 276",
    "page_number": 276
  },
  {
    "cis_id": "2.3.17.6",
    "title": "Ensure 'User Account Control: Run all\nadministrators in Admin Approval Mode' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of all User Account Control (UAC) policy\nsettings for the computer. If you change this policy setting, you must restart your\ncomputer.\nThe recommended state for this setting is: Enabled.\nNote: If this policy setting is disabled, the Security Center notifies you that the overall\nsecurity of the operating system has been reduced.",
    "rationale": "This is the setting that turns on or off UAC. If this setting is disabled, UAC will not be\nused and any security benefits and risk mitigations that are dependent on UAC will not\nbe present on the system.",
    "impact": "None - this is the default behavior. Users and administrators will need to learn to work\nwith UAC prompts and adjust their work habits to use least privilege operations.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:EnableLUA\nPage 277",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Run all administrators in\nAdmin Approval Mode",
    "default_value": "Enabled. (Admin Approval Mode is enabled. This policy must be enabled and related\nUAC policy settings must also be set appropriately to allow the built-in Administrator\naccount and all other users who are members of the Administrators group to run in\nAdmin Approval Mode.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-run-all-administrators-in-admin-approval-\nmode\n2. GRID: MS-00000125\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 278",
    "page_number": 278
  },
  {
    "cis_id": "2.3.17.7",
    "title": "Ensure 'User Account Control: Switch to the secure\ndesktop when prompting for elevation' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls whether the elevation request prompt is displayed on the\ninteractive user's desktop or the secure desktop.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Standard elevation prompt dialog boxes can be spoofed, which may cause users to\ndisclose their passwords to malicious software. The secure desktop presents a very\ndistinct appearance when prompting for elevation, where the user desktop dims, and\nthe elevation prompt UI is more prominent. This increases the likelihood that users who\nbecome accustomed to the secure desktop will recognize a spoofed elevation prompt\ndialog box and not fall for the trick.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:PromptOnSecure\nDesktop",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Switch to the secure desktop\nwhen prompting for elevation",
    "default_value": "Enabled. (All elevation requests go to the secure desktop regardless of prompt behavior\npolicy settings for administrators and standard users.)\nPage 279\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-switch-to-the-secure-desktop-when-\nprompting-for-elevation\n2. GRID: MS-00000126\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 280",
    "page_number": 280
  },
  {
    "cis_id": "2.3.17.8",
    "title": "Ensure 'User Account Control: Virtualize file and\nregistry write failures to per-user locations' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls whether application write failures are redirected to defined\nregistry and file system locations. This policy setting mitigates applications that run as\nadministrator and write run-time application data to:\n• %ProgramFiles%\n• %windir%\n• %windir%\\System32\n• HKLM\\SOFTWARE\nThe recommended state for this setting is: Enabled.",
    "rationale": "This setting reduces vulnerabilities by ensuring that legacy applications only write data\nto permitted locations.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:EnableVirtuali\nzation\nPage 281",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Virtualize file and registry\nwrite failures to per-user locations",
    "default_value": "Enabled. (Application write failures are redirected at run time to defined user locations\nfor both the file system and registry.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-virtualize-file-and-registry-write-failures-to-\nper-user-locations\n2. GRID: MS-00000127\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 282\n3 Event Log\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\n4 Restricted Groups\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\n5 System Services\nThis section contains recommendations for system services.\nPage 283",
    "page_number": 282
  }
]