[
  {
    "cis_id": "5.22",
    "title": "Ensure 'Server (LanmanServer)' is set to 'Disabled'",
    "profile": "L2",
    "description": "Supports file, print, and named-pipe sharing over the network for this computer. If this\nservice is stopped, these functions will be unavailable.\nThe recommended state for this setting is: Disabled.",
    "rationale": "In a high security environment, a secure workstation should only be a client, not a\nserver. Sharing workstation resources for remote access increases security risk as the\nattack surface is notably higher.",
    "impact": "File, print and named-pipe sharing functions will be unavailable from this machine over\nthe network.\nNote: Many remote administration tools, such as System Center Configuration Manager\n(SCCM), require the Server service to be operational for remote management. In\naddition, many vulnerability scanners use this service to scan the file system remotely.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name LanmanServer -StartupType Disabled",
    "default_value": "Windows 7 through Windows 10 R1703: Automatic\nWindows 10 R1709 or newer: Automatic (Trigger Start)\nPage 326\nReferences:\n1. GRID: MS-00000154\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 327",
    "page_number": 327
  }
]