[
  {
    "cis_id": "19.6.6.1.1",
    "title": "Ensure 'Turn off Help Experience Improvement\nProgram' is set to 'Enabled'",
    "profile": "L2",
    "description": "This policy setting specifies whether users can participate in the Help Experience\nImprovement program. The Help Experience Improvement program collects information\nabout how customers use Windows Help so that Microsoft can improve it.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Large enterprise managed environments may not want to have information collected by\nMicrosoft from managed client computers.",
    "impact": "Users cannot participate in the Help Experience Improvement program.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKU\\[USER\nSID]\\Software\\Policies\\Microsoft\\Assistance\\Client\\1.0:NoImplicitFeedback",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nUser Configuration\\Policies\\Administrative Templates\\System\\Internet\nCommunication Management\\Internet Communication Settings\\Turn off Help\nExperience Improvement Program\nNote: This Group Policy path is provided by the Group Policy template\nHelpAndSupport.admx/adml that is included with all versions of the Microsoft Windows\nAdministrative Templates.",
    "default_value": "Disabled. (Users can turn on the Help Experience Improvement program feature from\nthe Help and Support settings page.)\nPage 1253\nReferences:\n1. GRID: MS-00000558\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8 ● ●\nUninstall or disable unnecessary services on enterprise assets and software,\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nAre Running\nv7 ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 1254",
    "page_number": 1254
  }
]