[
  {
    "cis_id": "5.1",
    "title": "Ensure 'Bluetooth Audio Gateway Service\n(BTAGService)' is set to 'Disabled'",
    "profile": "L2",
    "description": "Service supporting the audio gateway role of the Bluetooth Handsfree Profile.\nThe recommended state for this setting is: Disabled.",
    "rationale": "Bluetooth technology has inherent security risks - especially prior to the v2.1 standard.\nWireless Bluetooth traffic is not well encrypted (if at all), so in a high-security\nenvironment, it should not be permitted, in spite of the added inconvenience of not\nbeing able to use Bluetooth devices.",
    "impact": "Bluetooth hands-free devices will not function properly with the computer.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\BTAGService:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name BTAGService -StartupType Disabled\nNote: This service was first introduced in Windows 10 Release 1803. It appears to have\nreplaced the older Bluetooth Handsfree Service (BthHFSrv), which was removed from\nWindows in that release (it is not simply a rename, but a different service).",
    "default_value": "Manual (Trigger Start)\nReferences:\n1. GRID: MS-00000128\nPage 284\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 285",
    "page_number": 285
  }
]