[
  {
    "cis_id": "1.1.1",
    "title": "Ensure 'Enforce password history' is set to '24 or more\npassword(s)'",
    "profile": "L1",
    "description": "This policy setting determines the number of renewed, unique passwords that have to\nbe associated with a user account before you can reuse an old password. The value for\nthis policy setting must be between 0 and 24 passwords. The default value for stand-\nalone systems is 0 passwords, but the default setting when joined to a domain is 24\npasswords. To maintain the effectiveness of this policy setting, use the Minimum\npassword age setting to prevent users from repeatedly changing their password.\nThe recommended state for this setting is: 24 or more password(s).\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.\nNote #2: As of the publication of this benchmark, Microsoft currently has a maximum\nlimit of 24 saved passwords. For more information, please visit Enforce password\nhistory (Windows 10) - Windows security | Microsoft Docs.",
    "rationale": "The longer a user uses the same password, the greater the chance that an attacker can\ndetermine the password through brute force attacks. Also, any accounts that may have\nbeen compromised will remain exploitable for as long as the password is left\nunchanged. If password changes are required but password reuse is not prevented, or if\nusers continually reuse a small number of passwords, the effectiveness of a good\npassword policy is greatly reduced.\nIf you specify a low number for this policy setting, users will be able to use the same\nsmall number of passwords repeatedly. If you do not also configure the Minimum\npassword age setting, users might repeatedly change their passwords until they can\nreuse their original password.\nPage 39",
    "impact": "The major impact of this configuration is that users must create a new password every\ntime they are required to change their old one. If users are required to change their\npasswords to new unique values, there is an increased risk of users who write their\npasswords somewhere so that they do not forget them. Another risk is that users may\ncreate passwords that change incrementally (for example, password01, password02,\nand so on) to facilitate memorization but make them easier to guess. Also, an\nexcessively low value for the Minimum password age setting will likely increase\nadministrative overhead, because users who forget their passwords might ask the help\ndesk to reset them frequently.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 24 or\nmore password(s):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Enforce password history",
    "default_value": "24 passwords remembered on domain members. 0 passwords remembered on stand-\nalone workstations.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000001\nPage 40\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\nPage 41",
    "page_number": 40
  },
  {
    "cis_id": "1.1.2",
    "title": "Ensure 'Maximum password age' is set to '365 or fewer\ndays, but not 0'",
    "profile": "L1",
    "description": "This policy setting defines how long a user can use their password before it expires.\nValues for this policy setting range from 0 to 999 days. If you set the value to 0, the\npassword will never expire.\nBecause attackers can crack passwords, the more frequently you change the password\nthe less opportunity an attacker has to use a cracked password. However, the lower this\nvalue is set, the higher the potential for an increase in calls to help desk support due to\nusers having to change their password or forgetting which password is current.\nThe recommended state for this setting is 365 or fewer days, but not 0.\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "The longer a password exists the higher the likelihood that it will be compromised by a\nbrute force attack, by an attacker gaining general knowledge about the user, or by the\nuser sharing the password. Configuring the Maximum password age setting to 0 so that\nusers are never required to change their passwords is a major security risk because\nthat allows a compromised password to be used by the malicious user for as long as the\nvalid user has authorized access.",
    "impact": "If the Maximum password age setting is too low, users are required to change their\npasswords very often. Such a configuration can reduce security in the organization,\nbecause users might write their passwords in an insecure location or lose them. If the\nvalue for this policy setting is too high, the level of security within an organization is\nreduced because it allows potential attackers more time in which to discover user\npasswords or to use compromised accounts.\nPage 42",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 365 or\nfewer days, but not 0:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Maximum password age",
    "default_value": "42 days.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000002\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n16.10 Ensure All Accounts Have An Expiration Date\nv7 ● ●\nEnsure that all accounts have an expiration date that is monitored and\nenforced.\nPage 43",
    "page_number": 43
  },
  {
    "cis_id": "1.1.3",
    "title": "Ensure 'Minimum password age' is set to '1 or more\nday(s)'",
    "profile": "L1",
    "description": "This policy setting determines the number of days that you must use a password before\nyou can change it. The range of values for this policy setting is between 1 and 999\ndays. (You may also set the value to 0 to allow immediate password changes.) The\ndefault value for this setting is 0 days.\nThe recommended state for this setting is: 1 or more day(s)).\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Users may have favorite passwords that they like to use because they are easy to\nremember and they believe that their password choice is secure from compromise.\nUnfortunately, passwords are compromised and if an attacker is targeting a specific\nindividual's user account, with foreknowledge of data about that user, reuse of old\npasswords can cause a security breach. To address password reuse a combination of\nsecurity settings is required. Using this policy setting with the Enforce password history\nsetting prevents the easy reuse of old passwords. For example, if you configure the\nEnforce password history setting to ensure that users cannot reuse any of their last 12\npasswords, they could change their password 13 times in a few minutes and reuse the\npassword they started with, unless you also configure the Minimum password age\nsetting to a number that is greater than 0. You must configure this policy setting to a\nnumber that is greater than 0 for the Enforce password history setting to be effective.",
    "impact": "If an administrator sets a password for a user but wants that user to change the\npassword when the user first logs on, the administrator must select the User must\nchange password at next logon check box, or the user will not be able to change the\npassword until the next day.\nPage 44",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 1 or\nmore day(s):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Minimum password age",
    "default_value": "1 day on domain members. 0 days on stand-alone workstations.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000003\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n16.10 Ensure All Accounts Have An Expiration Date\nv7 ● ●\nEnsure that all accounts have an expiration date that is monitored and\nenforced.\nPage 45",
    "page_number": 45
  },
  {
    "cis_id": "1.1.4",
    "title": "Ensure 'Minimum password length' is set to '14 or more\ncharacter(s)'",
    "profile": "L1",
    "description": "This policy setting determines the least number of characters that make up a password\nfor a user account. There are many different theories about how to determine the best\npassword length for an organization, but perhaps \"passphrase\" is a better term than\n\"password.\" In Microsoft Windows 2000 or newer, passphrases can be quite long and\ncan include spaces. Therefore, a phrase such as \"I want to drink a $5 milkshake\" is a\nvalid passphrase; it is a considerably stronger password than an 8 or 10 character string\nof random numbers and letters, and yet is easier to remember. Users must be educated\nabout the proper selection and maintenance of passwords, especially around password\nlength. In enterprise environments, the ideal value for the Minimum password length\nsetting is 14 characters, however you should adjust this value to meet your\norganization's business requirements.\nThe recommended state for this setting is: 14 or more character(s).\nNote: In Windows Server 2016 and older versions of Windows Server, the GUI of the\nLocal Security Policy (LSP), Local Group Policy Editor (LGPE) and Group Policy\nManagement Editor (GPME) would not let you set this value higher than 14 characters.\nHowever, starting with Windows Server 2019, Microsoft changed the GUI to allow up to\na 20 character minimum password length.\nNote #2: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Types of password attacks include dictionary attacks (which attempt to use common\nwords and phrases) and brute force attacks (which try every possible combination of\ncharacters). Also, attackers sometimes try to obtain the account database so they can\nuse tools to discover the accounts and passwords.\nPage 46",
    "impact": "Requirements for extremely long passwords can actually decrease the security of an\norganization, because users might leave the information in an insecure location or lose\nit. If very long passwords are required, mistyped passwords could cause account\nlockouts and increase the volume of help desk calls. If your organization has issues with\nforgotten passwords due to password length requirements, consider teaching your\nusers about passphrases, which are often easier to remember and, due to the larger\nnumber of character combinations, much harder to discover.\nNote: Older versions of Windows such as Windows 98 and Windows NT 4.0 do not\nsupport passwords that are longer than 14 characters. Computers that run these older\noperating systems are unable to authenticate with computers or domains that use\naccounts that require long passwords.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 14 or\nmore character(s):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Minimum password length",
    "default_value": "7 characters on domain members. 0 characters on stand-alone servers.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000004\nPage 47\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n4.4 Use Unique Passwords\nv7 Where multi-factor authentication is not supported (such as local administrator, ● ●\nroot, or service accounts), accounts will use passwords that are unique to that\nsystem.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\nPage 48",
    "page_number": 47
  },
  {
    "cis_id": "1.1.5",
    "title": "Ensure 'Password must meet complexity requirements'\nis set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting checks all new passwords to ensure that they meet basic\nrequirements for strong passwords.\nWhen this policy is enabled, passwords must meet the following minimum requirements:\n• Not contain the user's account name or parts of the user's full name that exceed\ntwo consecutive characters\n• Be at least six characters in length\n• Contain characters from three of the following categories:\no English uppercase characters (A through Z)\no English lowercase characters (a through z)\no Base 10 digits (0 through 9)\no Non-alphabetic characters (for example, !, $, #, %)\no A catch-all category of any Unicode character that does not fall under the\nprevious four categories. This fifth category can be regionally specific.\nEach additional character in a password increases its complexity exponentially. For\ninstance, a seven-character, all lower-case alphabetic password would have 26 to the\npower of 7 (approximately 8 x 10 to the power of 9 or 8 billion) possible combinations.\nAt 1,000,000 attempts per second (a capability of many password-cracking utilities), it\nwould only take 133 minutes to crack. A seven-character alphabetic password with case\nsensitivity has 52 to the power of 7 combinations. A seven-character case-sensitive\nalphanumeric password without punctuation has 627 combinations. An eight-character\npassword has 26 to the power of 8 (or 2 x 10 to the power of 11) possible combinations.\nAlthough this might seem to be a large number, at 1,000,000 attempts per second it\nwould take only 59 hours to try all possible passwords. Remember, these times will\nsignificantly increase for passwords that use ALT characters and other special keyboard\ncharacters such as \"!\" or \"@\". Proper use of the password settings can help make it\ndifficult to mount a brute force attack.\nThe recommended state for this setting is: Enabled.\nPage 49\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Passwords that contain only alphanumeric characters are extremely easy to discover\nwith several publicly available tools.",
    "impact": "If the default password complexity configuration is retained, additional help desk calls\nfor locked-out accounts could occur because users might not be accustomed to\npasswords that contain non-alphabetic characters. However, all users should be able to\ncomply with the complexity requirement with minimal difficulty.\nIf your organization has more stringent security requirements, you can create a custom\nversion of the Passfilt.dll file that allows the use of arbitrarily complex password strength\nrules. For example, a custom password filter might require the use of non-upper row\ncharacters. (Upper row characters are those that require you to hold down the SHIFT\nkey and press any of the digits between 1 and 0.) A custom password filter might also\nperform a dictionary check to verify that the proposed password does not contain\ncommon dictionary words or fragments.\nAlso, the use of ALT key character combinations can greatly enhance the complexity of\na password. However, such stringent password requirements can result in unhappy\nusers and an extremely busy help desk. Alternatively, your organization could consider\na requirement for all administrator passwords to use ALT characters in the 0128 - 0159\nrange. (ALT characters outside of this range can represent standard alphanumeric\ncharacters that would not add additional complexity to the password.)",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 50",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Password must meet complexity requirements",
    "default_value": "Enabled on domain members. Disabled on stand-alone workstations.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000005\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n4.4 Use Unique Passwords\nv7 Where multi-factor authentication is not supported (such as local administrator, ● ●\nroot, or service accounts), accounts will use passwords that are unique to that\nsystem.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\nPage 51",
    "page_number": 50
  },
  {
    "cis_id": "1.1.6",
    "title": "Ensure 'Relax minimum password length limits' is set to\n'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the minimum password length setting can be\nincreased beyond the legacy limit of 14 characters. For more information, please see\nthe following Microsoft Security Blog.\nThe recommended state for this setting is: Enabled.\nNote: This setting only affects local accounts on the computer. Domain accounts are\nonly affected by settings on the Domain Controllers, because that is where domain\naccounts are stored.",
    "rationale": "This setting will enable the enforcement of longer and generally stronger passwords or\npassphrases where MFA is not in use.",
    "impact": "The Minimum password length setting may be configured higher than 14 characters.\nIf very long passwords are required, mistyped passwords could cause account lockouts\nand increase the volume of help desk calls. If your organization has issues with\nforgotten passwords due to password length requirements, consider teaching your\nusers about passphrases, which are often easier to remember and, due to the larger\nnumber of character combinations, much harder to discover.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\System\\CurrentControlSet\\Control\\SAM:RelaxMinimumPasswordLengthLimits\nPage 52",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Relax minimum password length limits\nNote: This setting is only available within the built-in OS security template of Windows\n10 Release 2004 and Server 2022 (or newer), and is not available via older versions of\nthe OS, or via downloadable Administrative Templates (ADMX/ADML). Therefore, you\nmust use a Windows 10 Release 2004 or Server 2022 system (or newer) to view or edit\nthis setting with the Group Policy Management Console (GPMC) or Group Policy\nManagement Editor (GPME).",
    "default_value": "Disabled. (The Minimum password length may be configured to a maximum of 14\ncharacters.)\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://support.microsoft.com/en-us/topic/minimum-password-length-auditing-\nand-enforcement-on-certain-versions-of-windows-5ef7fecf-3325-f56b-cc10-\n4fd565aacc59\n3. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n4. GRID: MS-00000006\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n5.2 Use Unique Passwords\nv8 Use unique passwords for all enterprise assets. Best practice implementation ● ● ●\nincludes, at a minimum, an 8-character password for accounts using MFA and a\n14-character password for accounts not using MFA.\n16.4 Encrypt or Hash all Authentication Credentials\nv7 ● ●\nEncrypt or hash with a salt all authentication credentials when stored.\nPage 53",
    "page_number": 53
  },
  {
    "cis_id": "1.1.7",
    "title": "Ensure 'Store passwords using reversible encryption' is\nset to 'Disabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the operating system stores passwords in a way\nthat uses reversible encryption, which provides support for application protocols that\nrequire knowledge of the user's password for authentication purposes. Passwords that\nare stored with reversible encryption are essentially the same as plaintext versions of\nthe passwords.\nThe recommended state for this setting is: Disabled.\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Enabling this policy setting allows the operating system to store passwords in a weaker\nformat that is much more susceptible to compromise and weakens your system\nsecurity.",
    "impact": "If your organization uses either the CHAP authentication protocol through remote\naccess or IAS services or Digest Authentication in IIS, you must configure this policy\nsetting to Enabled. This setting is extremely dangerous to apply through Group Policy\non a user-by-user basis, because it requires the appropriate user account object to be\nopened in Active Directory Users and Computers.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 54",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Password Policy\\Store passwords using reversible encryption",
    "default_value": "Disabled.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/password-policy\n3. GRID: MS-00000007\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.11 Encrypt Sensitive Data at Rest\nEncrypt sensitive data at rest on servers, applications, and databases containing\nv8 sensitive data. Storage-layer encryption, also known as server-side encryption, ● ●\nmeets the minimum requirement of this Safeguard. Additional encryption methods\nmay include application-layer encryption, also known as client-side encryption,\nwhere access to the data storage device(s) does not permit access to the plain-text\ndata.\n16.4 Encrypt or Hash all Authentication Credentials\nv7 ● ●\nEncrypt or hash with a salt all authentication credentials when stored.\nPage 55",
    "page_number": 55
  },
  {
    "cis_id": "1.2.1",
    "title": "Ensure 'Account lockout duration' is set to '15 or more\nminute(s)'",
    "profile": "L1",
    "description": "This policy setting determines the length of time that must pass before a locked account\nis unlocked and a user can try to log on again. The setting does this by specifying the\nnumber of minutes a locked out account will remain unavailable. If the value for this\npolicy setting is configured to 0, locked out accounts will remain locked out until an\nadministrator manually unlocks them.\nAlthough it might seem like a good idea to configure the value for this policy setting to a\nhigh value, such a configuration will likely increase the number of calls that the help\ndesk receives to unlock accounts locked by mistake. Users should be aware of the\nlength of time a lock remains in place, so that they realize they only need to call the help\ndesk if they have an extremely urgent need to regain access to their computer.\nThe recommended state for this setting is: 15 or more minute(s).\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "A denial of service (DoS) condition can be created if an attacker abuses the Account\nlockout threshold and repeatedly attempts to log on with a specific account. Once you\nconfigure the Account lockout threshold setting, the account will be locked out after the\nspecified number of failed attempts. If you configure the Account lockout duration\nsetting to 0, then the account will remain locked out until an administrator unlocks it\nmanually.",
    "impact": "Although it may seem like a good idea to configure this policy setting to never\nautomatically unlock an account, such a configuration can increase the number of\nrequests that your organization's help desk receives to unlock accounts that were\nlocked by mistake.\nPage 57",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 15 or\nmore minute(s):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Account Lockout Policy\\Account lockout duration",
    "default_value": "None, because this policy setting only has meaning when an Account lockout threshold\nis specified. When an Account lockout threshold is configured, Windows automatically\nsuggests a value of 30 minutes.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. GRID: MS-00000008\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.10 Enforce Automatic Device Lockout on Portable End-\nUser Devices\nv8\nEnforce automatic device lockout following a predetermined threshold of local\n● ●\nfailed authentication attempts on portable end-user devices, where supported. For\nlaptops, do not allow more than 20 failed authentication attempts; for tablets and\nsmartphones, no more than 10 failed authentication attempts. Example\nimplementations include Microsoft® InTune Device Lock and Apple® Configuration\nProfile maxFailedAttempts.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\nPage 58",
    "page_number": 58
  },
  {
    "cis_id": "1.2.2",
    "title": "Ensure 'Account lockout threshold' is set to '5 or fewer\ninvalid logon attempt(s), but not 0'",
    "profile": "L1",
    "description": "This policy setting determines the number of failed logon attempts before the account is\nlocked. Setting this policy to 0 does not conform to the benchmark as doing so disables\nthe account lockout threshold.\nThe recommended state for this setting is: 5 or fewer invalid logon attempt(s),\nbut not 0.\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Setting an account lockout threshold reduces the likelihood that an online password\nbrute force attack will be successful. Setting the account lockout threshold too low\nintroduces risk of increased accidental lockouts and/or a malicious actor intentionally\nlocking out accounts.",
    "impact": "If this policy setting is enabled, a locked-out account will not be usable until it is reset by\nan administrator or until the account lockout duration expires. This setting may generate\nadditional help desk calls.\nIf you enforce this setting an attacker could cause a denial of service condition by\ndeliberately generating failed logons for multiple user, therefore you should also\nconfigure the Account Lockout Duration to a relatively low value.\nIf you configure the Account Lockout Threshold to 0, there is a possibility that an\nattacker's attempt to discover passwords with a brute force password attack might go\nundetected if a robust audit mechanism is not in place.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 59",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 5 or\nfewer invalid login attempt(s), but not 0:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Account Lockout Policy\\Account lockout threshold",
    "default_value": "0 failed logon attempts.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. GRID: MS-00000009\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.10 Enforce Automatic Device Lockout on Portable End-\nUser Devices\nv8\nEnforce automatic device lockout following a predetermined threshold of local\n● ●\nfailed authentication attempts on portable end-user devices, where supported. For\nlaptops, do not allow more than 20 failed authentication attempts; for tablets and\nsmartphones, no more than 10 failed authentication attempts. Example\nimplementations include Microsoft® InTune Device Lock and Apple® Configuration\nProfile maxFailedAttempts.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\nPage 60",
    "page_number": 60
  },
  {
    "cis_id": "1.2.3",
    "title": "Ensure 'Allow Administrator account lockout' is set to\n'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the built-in Administrator account is subject to\nthe following Account Lockout Policy settings: Account lockout duration, Account\nlockout threshold, and Reset account lockout counter. By default, this account is\nexcluded from the account lockout controls and will never be locked out with repeated\nbad password attempts.\nThe recommended state for this setting is: Enabled.\nNote: This setting applies only to OSes patched as of October 11, 2022 (see MS\nKB5020282).",
    "rationale": "Enabling account lockout policies for the built-in Administrator account will reduce the\nlikelihood of a successful brute force attack.",
    "impact": "The built-in Administrator account will be subject to the policies in Section 1.2 Account\nLockout Policy of this benchmark.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Account Lockout Policies\\Allow Administrator account lockout",
    "default_value": "Disabled. (The built-in Administrator account is not subject to the account lockout\npolicy.)\nPage 61\nReferences:\n1. https://support.microsoft.com/en-us/topic/kb5020282-account-lockout-available-\nfor-built-in-local-administrators-bce45c4d-f28d-43ad-b6fe-70156cb2dc00\n2. GRID: MS-00000010\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.10 Enforce Automatic Device Lockout on Portable End-\nUser Devices\nv8\nEnforce automatic device lockout following a predetermined threshold of local\n● ●\nfailed authentication attempts on portable end-user devices, where supported. For\nlaptops, do not allow more than 20 failed authentication attempts; for tablets and\nsmartphones, no more than 10 failed authentication attempts. Example\nimplementations include Microsoft® InTune Device Lock and Apple® Configuration\nProfile maxFailedAttempts.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\n16.12 Monitor Attempts to Access Deactivated Accounts\nv7 ● ●\nMonitor attempts to access deactivated accounts through audit logging.\nPage 62",
    "page_number": 62
  }
]