[
  {
    "cis_id": "2.3.10.8",
    "title": "Ensure 'Network access: Remotely accessible\nregistry paths and sub-paths' is configured",
    "profile": "L1",
    "description": "This policy setting determines which registry paths and sub-paths will be accessible\nover the network, regardless of the users or groups listed in the access control list\n(ACL) of the winreg registry key.\nNote: In Windows XP this setting is called \"Network access: Remotely accessible\nregistry paths,\" the setting with that same name in Windows Vista, Windows Server\n2008 (non-R2), and Windows Server 2003 does not exist in Windows XP.\nNote #2: When you configure this setting you specify a list of one or more objects. The\ndelimiter used when entering the list is a line feed or carriage return, that is, type the\nfirst object on the list, press the Enter button, type the next object, press Enter again,\netc. The setting value is stored as a comma-delimited list in group policy security\ntemplates. It is also rendered as a comma-delimited list in Group Policy Editor's display\npane and the Resultant Set of Policy console. It is recorded in the registry as a line-feed\ndelimited list in a REG_MULTI_SZ value.\nThe recommended state for this setting is:\nSystem\\CurrentControlSet\\Control\\Print\\Printers\nSystem\\CurrentControlSet\\Services\\Eventlog\nSoftware\\Microsoft\\OLAP Server\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Windows\nSystem\\CurrentControlSet\\Control\\ContentIndex\nSystem\\CurrentControlSet\\Control\\Terminal Server\nSystem\\CurrentControlSet\\Control\\Terminal Server\\UserConfig\nSystem\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\nSystem\\CurrentControlSet\\Services\\SysmonLog",
    "rationale": "The registry contains sensitive computer configuration information that could be used by\nan attacker to facilitate unauthorized activities. The fact that the default ACLs assigned\nthroughout the registry are fairly restrictive and help to protect the registry from access\nby unauthorized users reduces the risk of such an attack.\nPage 218",
    "impact": "None - this is the default behavior. However, if you remove the default registry paths\nfrom the list of accessible ones, remote management tools such as the Microsoft\nBaseline Security Analyzer and Microsoft Systems Management Server could fail, as\nthey require remote access to the registry to properly monitor and manage computers.\nNote: If you want to allow remote access, you must also enable the Remote Registry\nservice.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of System\\CurrentControlSet\\Control\\Print\\Printers,\nSystem\\CurrentControlSet\\Services\\Eventlog, Software\\Microsoft\\OLAP\nServer, Software\\Microsoft\\Windows NT\\CurrentVersion\\Print,\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Windows,\nSystem\\CurrentControlSet\\Control\\ContentIndex,\nSystem\\CurrentControlSet\\Control\\Terminal Server,\nSystem\\CurrentControlSet\\Control\\Terminal Server\\UserConfig,\nSystem\\CurrentControlSet\\Control\\Terminal\nServer\\DefaultUserConfiguration, Software\\Microsoft\\Windows\nNT\\CurrentVersion\\Perflib and\nSystem\\CurrentControlSet\\Services\\SysmonLog.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurePipeServers\\Winreg\\AllowedPaths:M\nachine\nPage 219",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to:\nSystem\\CurrentControlSet\\Control\\Print\\Printers\nSystem\\CurrentControlSet\\Services\\Eventlog SOFTWARE\\Microsoft\\OLAP\nServer SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Print\nSOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Windows\nSystem\\CurrentControlSet\\Control\\ContentIndex\nSystem\\CurrentControlSet\\Control\\Terminal Server\nSystem\\CurrentControlSet\\Control\\Terminal Server\\UserConfig\nSystem\\CurrentControlSet\\Control\\Terminal\nServer\\DefaultUserConfiguration SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Perflib System\\CurrentControlSet\\Services\\SysmonLog\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network access: Remotely accessible registry paths\nand sub-paths",
    "default_value": "System\\CurrentControlSet\\Control\\Print\\Printers\nSystem\\CurrentControlSet\\Services\\Eventlog Software\\Microsoft\\OLAP Server\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Print Software\\Microsoft\\Windows\nNT\\CurrentVersion\\Windows System\\CurrentControlSet\\Control\\ContentIndex\nSystem\\CurrentControlSet\\Control\\Terminal Server\nSystem\\CurrentControlSet\\Control\\Terminal Server\\UserConfig\nSystem\\CurrentControlSet\\Control\\Terminal Server\\DefaultUserConfiguration\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\Perflib\nSystem\\CurrentControlSet\\Services\\SysmonLog\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-access-remotely-accessible-registry-paths-and-subpaths\n2. GRID: MS-00000097\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 220",
    "page_number": 219
  },
  {
    "cis_id": "2.3.10.9",
    "title": "Ensure 'Network access: Restrict anonymous\naccess to Named Pipes and Shares' is set to 'Enabled'",
    "profile": "L1",
    "description": "When enabled, this policy setting restricts anonymous access to only those shares and\npipes that are named in the Network access: Named pipes that can be accessed\nanonymously and Network access: Shares that can be accessed anonymously\nsettings. This policy setting controls null session access to shares on your computers by\nadding RestrictNullSessAccess with the value 1 in the\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LanManServer\\Parameters\nregistry key. This registry value toggles null session shares on or off to control whether\nthe server service restricts unauthenticated clients' access to named resources.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Null sessions are a weakness that can be exploited through shares (including the\ndefault shares) on computers in your environment.\nPage 221",
    "impact": "None - this is the default behavior. If you choose to enable this setting and are\nsupporting Windows NT 4.0 domains, you should check if any of the named pipes are\nrequired to maintain trust relationships between the domains, and then add the pipe to\nthe Network access: Named pipes that can be accessed anonymously list:\n• COMNAP: SNA session access\n• COMNODE: SNA session access\n• SQL\\QUERY: SQL instance access\n• SPOOLSS: Spooler service\n• LLSRPC: License Logging service\n• NETLOGON: Net Logon service\n• LSARPC: LSA access\n• SAMR: Remote access to SAM objects\n• BROWSER: Computer Browser service\nPrevious to the release of Windows Server 2003 with Service Pack 1 (SP1) these\nnamed pipes were allowed anonymous access by default, but with the increased\nhardening in Windows Server 2003 with SP1 these pipes must be explicitly added if\nneeded.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LanManServer\\Parameters:RestrictNullSe\nssAccess",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network access: Restrict anonymous access to Named\nPipes and Shares",
    "default_value": "Enabled. (Anonymous access is restricted to shares and pipes listed in the Network\naccess: Named pipes that can be accessed anonymously and Network\naccess: Shares that can be accessed anonymously settings.)\nPage 222\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-access-restrict-anonymous-access-to-named-pipes-and-\nshares\n2. GRID: MS-00000099\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 223",
    "page_number": 222
  },
  {
    "cis_id": "2.3.10.10",
    "title": "Ensure 'Network access: Restrict clients allowed to\nmake remote calls to SAM' is set to 'Administrators: Remote\nAccess: Allow'",
    "profile": "L1",
    "description": "This policy setting allows you to restrict remote RPC connections to SAM.\nThe recommended state for this setting is: Administrators: Remote Access: Allow.\nNote: A Windows 10 R1607, Server 2016 or newer OS is required to access and set\nthis value in Group Policy.\nNote #2: This setting was originally only supported on Windows 10 R1607 or newer,\nthen support for it was added to Windows 7 or newer via the March 2017 security\npatches.\nNote #3: If your organization is using Microsoft Defender for Identity (formerly Azure\nAdvanced Threat Protection (Azure ATP)), the (organization-named) Defender for\nIdentity Directory Service Account (DSA), will also need to be granted the same Remote\nAccess: Allow permission. For more information on adding the service account please\nsee Configure SAM-R to enable lateral movement path detection in Microsoft Defender\nfor Identity | Microsoft Docs.",
    "rationale": "To ensure that an unauthorized user cannot anonymously list local account names or\ngroups and use the information to attempt to guess passwords or perform social\nengineering attacks. (Social engineering attacks try to deceive users in some way to\nobtain passwords or some form of security information.)",
    "impact": "None - this is the default behavior.\nPage 224",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_SZ value of O:BAG:BAD:(A;;RC;;;BA).\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:restrictremotesam",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators: Remote Access: Allow:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network access: Restrict clients allowed to make\nremote calls to SAM",
    "default_value": "Administrators: Remote Access: Allow.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-access-restrict-clients-allowed-to-make-remote-sam-calls\n2. GRID: MS-00000100\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 225",
    "page_number": 225
  },
  {
    "cis_id": "2.3.10.11",
    "title": "Ensure 'Network access: Shares that can be\naccessed anonymously' is set to 'None'",
    "profile": "L1",
    "description": "This policy setting determines which network shares can be accessed by anonymous\nusers. The default configuration for this policy setting has little effect because all users\nhave to be authenticated before they can access shared resources on the server.\nThe recommended state for this setting is: <blank> (i.e. None).",
    "rationale": "It is very dangerous to allow any values in this setting. Any shares that are listed can be\naccessed by any network user, which could lead to the exposure or corruption of\nsensitive data.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_MULTI_SZ value that is blank i.e. no value in key.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LanManServer\\Parameters:NullSessionSha\nres",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\n<blank> (i.e. None):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network access: Shares that can be accessed\nanonymously",
    "default_value": "None. (Only authenticated users will have access to all shared resources on the server.)\nPage 226\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-access-shares-that-can-be-accessed-anonymously\n2. GRID: MS-00000101\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n14.6 Protect Information through Access Control Lists\nProtect all information stored on systems with file system, network share,\nv7 claims, application, or database specific access control lists. These controls will ● ● ●\nenforce the principle that only authorized individuals should have access to the\ninformation based on their need to access the information as a part of their\nresponsibilities.\nPage 227",
    "page_number": 227
  },
  {
    "cis_id": "2.3.10.12",
    "title": "Ensure 'Network access: Sharing and security\nmodel for local accounts' is set to 'Classic - local users\nauthenticate as themselves'",
    "profile": "L1",
    "description": "This policy setting determines how network logons that use local accounts are\nauthenticated. The Classic option allows precise control over access to resources,\nincluding the ability to assign different types of access to different users for the same\nresource. The Guest only option allows you to treat all users equally. In this context, all\nusers authenticate as Guest only to receive the same access level to a given resource.\nThe recommended state for this setting is: Classic - local users authenticate\nas themselves.\nNote: This setting does not affect interactive logons that are performed remotely by\nusing such services as Telnet or Remote Desktop Services (formerly called Terminal\nServices).",
    "rationale": "With the Guest only model, any user who can authenticate to your computer over the\nnetwork does so with guest privileges, which probably means that they will not have\nwrite access to shared resources on that computer. Although this restriction does\nincrease security, it makes it more difficult for authorized users to access shared\nresources on those computers because ACLs on those resources must include access\ncontrol entries (ACEs) for the Guest account. With the Classic model, local accounts\nshould be password protected. Otherwise, if Guest access is enabled, anyone can use\nthose user accounts to access shared system resources.",
    "impact": "None - this is the default configuration for domain-joined computers.\nPage 228",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:ForceGuest",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nClassic - local users authenticate as themselves:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network access: Sharing and security model for\nlocal accounts",
    "default_value": "On domain-joined computers: Classic - local users authenticate as themselves.\n(Network logons that use local account credentials authenticate by using those\ncredentials.)\nOn stand-alone computers: Guest only - local users authenticate as Guest. (Network\nlogons that use local accounts are automatically mapped to the Guest account.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-access-sharing-and-security-model-for-local-accounts\n2. GRID: MS-00000102\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 229",
    "page_number": 229
  },
  {
    "cis_id": "2.3.11.1",
    "title": "Ensure 'Network security: Allow Local System to use\ncomputer identity for NTLM' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether Local System services that use Negotiate when\nreverting to NTLM authentication can use the computer identity. This policy is supported\non at least Windows 7 or Windows Server 2008 R2.\nThe recommended state for this setting is: Enabled.",
    "rationale": "When connecting to computers running versions of Windows earlier than Windows Vista\nor Windows Server 2008 (non-R2), services running as Local System and using\nSPNEGO (Negotiate) that revert to NTLM use the computer identity. In Windows 7, if\nyou are connecting to a computer running Windows Server 2008 or Windows Vista,\nthen a system service uses either the computer identity or a NULL session. When\nconnecting with a NULL session, a system-generated session key is created, which\nprovides no protection but allows applications to sign and encrypt data without errors.\nWhen connecting with the computer identity, both signing and encryption is supported in\norder to provide data protection.",
    "impact": "Services running as Local System that use Negotiate when reverting to NTLM\nauthentication will use the computer identity. This might cause some authentication\nrequests between Windows operating systems to fail and log an error.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:UseMachineId\nPage 231",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Allow Local System to use\ncomputer identity for NTLM",
    "default_value": "Disabled. (Services running as Local System that use Negotiate when reverting to\nNTLM authentication will authenticate anonymously.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-allow-local-system-to-use-computer-identity-for-\nntlm\n2. GRID: MS-00000103\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 232",
    "page_number": 232
  },
  {
    "cis_id": "2.3.11.2",
    "title": "Ensure 'Network security: Allow LocalSystem NULL\nsession fallback' is set to 'Disabled'",
    "profile": "L1",
    "description": "This policy setting determines whether NTLM is allowed to fall back to a NULL session\nwhen used with LocalSystem.\nThe recommended state for this setting is: Disabled.",
    "rationale": "NULL sessions are less secure because by definition they are unauthenticated.",
    "impact": "None - this is the default behavior. Any applications that require NULL sessions for\nLocalSystem will not work as designed.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:AllowNullSessionFallback",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Allow LocalSystem NULL session\nfallback",
    "default_value": "Disabled. (NTLM will not be permitted to fall back to a NULL session when used with\nLocalSystem.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-allow-localsystem-null-session-fallback\n2. GRID: MS-00000104\nPage 233\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 234",
    "page_number": 234
  },
  {
    "cis_id": "2.3.11.3",
    "title": "Ensure 'Network Security: Allow PKU2U\nauthentication requests to this computer to use online identities' is\nset to 'Disabled'",
    "profile": "L1",
    "description": "This setting determines if online identities are able to authenticate to this computer.\nThe Public Key Cryptography Based User-to-User (PKU2U) protocol introduced in\nWindows 7 and Windows Server 2008 R2 is implemented as a security support provider\n(SSP). The SSP enables peer-to-peer authentication, particularly through the Windows\n7 media and file sharing feature called HomeGroup, which permits sharing between\ncomputers that are not members of a domain.\nWith PKU2U, a new extension was introduced to the Negotiate authentication package,\nSpnego.dll. In previous versions of Windows, Negotiate decided whether to use\nKerberos or NTLM for authentication. The extension SSP for Negotiate, Negoexts.dll,\nwhich is treated as an authentication protocol by Windows, supports Microsoft SSPs\nincluding PKU2U.\nWhen computers are configured to accept authentication requests by using online IDs,\nNegoexts.dll calls the PKU2U SSP on the computer that is used to log on. The\nPKU2U SSP obtains a local certificate and exchanges the policy between the peer\ncomputers. When validated on the peer computer, the certificate within the metadata is\nsent to the logon peer for validation and associates the user's certificate to a security\ntoken and the logon process completes.\nThe recommended state for this setting is: Disabled.\nNote: If a hybrid environment is used, and PKU2U is Disabled, Remote Desktop\nconnections from a hybrid joined system to a hybrid joined system will fail.",
    "rationale": "The PKU2U protocol is a peer-to-peer authentication protocol - authentication should be\nmanaged centrally in most managed networks.",
    "impact": "None - this is the default configuration for domain-joined computers.\nPage 235",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\pku2u:AllowOnlineID",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network Security: Allow PKU2U authentication\nrequests to this computer to use online identities",
    "default_value": "Disabled. (Online identities will not to be allowed to authenticate to a domain-joined\nmachine.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-allow-pku2u-authentication-requests-to-this-\ncomputer-to-use-online-identities\n2. GRID: MS-00000105\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.1 Establish and Maintain a Secure Configuration Process\nEstablish and maintain a secure configuration process for enterprise assets\nv8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ●\nservers) and software (operating systems and applications). Review and update\ndocumentation annually, or when significant enterprise changes occur that could\nimpact this Safeguard.\n9.2 Ensure Only Approved Ports, Protocols and Services\nAre Running\nv7 ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 236",
    "page_number": 236
  },
  {
    "cis_id": "2.3.11.4",
    "title": "Ensure 'Network security: Configure encryption\ntypes allowed for Kerberos' is set to 'AES128_HMAC_SHA1,\nAES256_HMAC_SHA1, Future encryption types'",
    "profile": "L1",
    "description": "This policy setting allows you to set the encryption types that Kerberos is allowed to\nuse.\nThe recommended state for this setting is: AES128_HMAC_SHA1, AES256_HMAC_SHA1,\nFuture encryption types.\nNote: Some legacy applications and OSes may still require RC4_HMAC_MD5 - we\nrecommend you test in your environment and verify whether you can safely remove it.",
    "rationale": "The strength of each encryption algorithm varies from one to the next, choosing\nstronger algorithms will reduce the risk of compromise however doing so may cause\nissues when the computer attempts to authenticate with systems that do not support\nthem.",
    "impact": "If not selected, the encryption type will not be allowed. This setting may affect\ncompatibility with client computers or services and applications. Multiple selections are\npermitted.\nNote: Some legacy applications and OSes may still require RC4_HMAC_MD5 - we\nrecommend you test in your environment and verify whether you can safely remove it.\nNote #2: Windows Vista and below allow DES for Kerberos by default, but later OS\nversions do not.\nNote #3: Some prerequisites might need to be met on Domain Controllers to support\nKerberos AES 128 and 256 bit encryption types, as well as enabling support for\nKerberos AES 128 and 256 bit on user accounts (in account options) for this\nrecommendation to work correctly.\nNote #4: If your organization uses Azure Files, please note that Microsoft did not\nintroduce AES 256 Kerberos encryption support for it until AD DS authentication module\nv0.2.2. Please see this link for more information:\nAzure Files on-premises AD DS Authentication support for AES 256 Kerberos\nencryption | Microsoft Docs\nPage 237",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 2147483640.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\Kerberos\\Param\neters:SupportedEncryptionTypes",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAES128_HMAC_SHA1, AES256_HMAC_SHA1, Future encryption types:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Configure encryption types\nallowed for Kerberos",
    "default_value": "RC4_HMAC_MD5, AES128_HMAC_SHA1, AES256_HMAC_SHA1, Future encryption\ntypes.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-configure-encryption-types-allowed-for-kerberos\n2. GRID: MS-00000106\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n14.4 Encrypt All Sensitive Information in Transit\nv7 ● ●\nEncrypt all sensitive information in transit.\n18.5 Use Only Standardized and Extensively Reviewed\nv7 Encryption Algorithms ● ●\nUse only standardized and extensively reviewed encryption algorithms.\nPage 238",
    "page_number": 238
  },
  {
    "cis_id": "2.3.11.5",
    "title": "Ensure 'Network security: Do not store LAN\nManager hash value on next password change' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the LAN Manager (LM) hash value for the new\npassword is stored when the password is changed. The LM hash is relatively weak and\nprone to attack compared to the cryptographically stronger Microsoft Windows NT hash.\nSince LM hashes are stored on the local computer in the security database, passwords\ncan then be easily compromised if the database is attacked.\nNote: Older operating systems and some third-party applications may fail when this\npolicy setting is enabled. Also, note that the password will need to be changed on all\naccounts after you enable this setting to gain the proper benefit.\nThe recommended state for this setting is: Enabled.",
    "rationale": "The SAM file can be targeted by attackers who seek access to username and password\nhashes. Such attacks use special tools to crack passwords, which can then be used to\nimpersonate users and gain access to resources on your network. These types of\nattacks will not be prevented if you enable this policy setting, but it will be much more\ndifficult for these types of attacks to succeed.",
    "impact": "None - this is the default behavior. Earlier operating systems such as Windows 95,\nWindows 98, and Windows ME as well as some third-party applications will fail.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:NoLMHash\nPage 239",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Do not store LAN Manager hash\nvalue on next password change",
    "default_value": "Enabled. (LAN Manager hash values are not stored when passwords are changed.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-do-not-store-lan-manager-hash-value-on-next-\npassword-change\n2. GRID: MS-00000107\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.11 Encrypt Sensitive Data at Rest\nEncrypt sensitive data at rest on servers, applications, and databases containing\nv8 sensitive data. Storage-layer encryption, also known as server-side encryption, ● ●\nmeets the minimum requirement of this Safeguard. Additional encryption methods\nmay include application-layer encryption, also known as client-side encryption,\nwhere access to the data storage device(s) does not permit access to the plain-text\ndata.\n16.4 Encrypt or Hash all Authentication Credentials\nv7 ● ●\nEncrypt or hash with a salt all authentication credentials when stored.\nPage 240",
    "page_number": 240
  }
]