[
  {
    "cis_id": "2.2.11",
    "title": "Ensure 'Create a token object' is set to 'No One'",
    "profile": "L1",
    "description": "This policy setting allows a process to create an access token, which may provide\nelevated rights to access sensitive data.\nThe recommended state for this setting is: No One.\nNote: This user right is considered a \"sensitive privilege\" for the purposes of auditing.",
    "rationale": "A user account that is given this user right has complete control over the system and\ncan lead to the system being compromised. It is highly recommended that you do not\nassign any user accounts this right.\nThe operating system examines a user's access token to determine the level of the\nuser's privileges. Access tokens are built when users log on to the local computer or\nconnect to a remote computer over a network. When you revoke a privilege, the change\nis immediately recorded, but the change is not reflected in the user's access token until\nthe next time the user logs on or connects. Users with the ability to create or modify\ntokens can change the level of access for any currently logged on account. They could\nescalate their own privileges or create a DoS condition.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No\nOne:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Create a token object",
    "default_value": "No one.\nPage 89\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/create-a-token-object\n2. GRID: MS-00000023\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 90",
    "page_number": 90
  },
  {
    "cis_id": "2.2.12",
    "title": "Ensure 'Create global objects' is set to 'Administrators,\nLOCAL SERVICE, NETWORK SERVICE, SERVICE'",
    "profile": "L1",
    "description": "This policy setting determines whether users can create global objects that are available\nto all sessions. Users can still create objects that are specific to their own session if they\ndo not have this user right.\nUsers who can create global objects could affect processes that run under other users'\nsessions. This capability could lead to a variety of problems, such as application failure\nor data corruption.\nThe recommended state for this setting is: Administrators, LOCAL SERVICE,\nNETWORK SERVICE, SERVICE.",
    "rationale": "Users who can create global objects could affect Windows services and processes that\nrun under other user or system accounts. This capability could lead to a variety of\nproblems, such as application failure, data corruption and elevation of privilege.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Create global objects",
    "default_value": "Administrators, LOCAL SERVICE, NETWORK SERVICE, SERVICE.\nPage 91\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/create-global-objects\n2. GRID: MS-00000024\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 92",
    "page_number": 92
  },
  {
    "cis_id": "2.2.13",
    "title": "Ensure 'Create permanent shared objects' is set to\n'No One'",
    "profile": "L1",
    "description": "This user right is useful to kernel-mode components that extend the object namespace.\nHowever, components that run in kernel mode have this user right inherently. Therefore,\nit is typically not necessary to specifically assign this user right.\nThe recommended state for this setting is: No One.",
    "rationale": "Users who have the Create permanent shared objects user right could create new\nshared objects and expose sensitive data to the network.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No\nOne:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Create permanent shared objects",
    "default_value": "No one.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/create-permanent-shared-objects\n2. GRID: MS-00000025\nPage 93\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 94",
    "page_number": 94
  },
  {
    "cis_id": "2.2.14",
    "title": "Ensure 'Create symbolic links' is set to 'Administrators'",
    "profile": "L1",
    "description": "This policy setting determines which users can create symbolic links. In Windows Vista,\nexisting NTFS file system objects, such as files and folders, can be accessed by\nreferring to a new kind of file system object called a symbolic link. A symbolic link is a\npointer (much like a shortcut or .lnk file) to another file system object, which can be a\nfile, folder, shortcut or another symbolic link. The difference between a shortcut and a\nsymbolic link is that a shortcut only works from within the Windows shell. To other\nprograms and applications, shortcuts are just another file, whereas with symbolic links,\nthe concept of a shortcut is implemented as a feature of the NTFS file system.\nSymbolic links can potentially expose security vulnerabilities in applications that are not\ndesigned to use them. For this reason, the privilege for creating symbolic links should\nonly be assigned to trusted users. By default, only Administrators can create\nsymbolic links.\nThe recommended state for this setting is: Administrators and (when the Hyper-V\nfeature is installed) NT VIRTUAL MACHINE\\Virtual Machines.",
    "rationale": "Users who have the Create symbolic links user right could inadvertently or maliciously\nexpose your system to symbolic link attacks. Symbolic link attacks can be used to\nchange the permissions on a file, to corrupt data, to destroy data, or as a Denial of\nService attack.",
    "impact": "In most cases there will be no impact because this is the default configuration.\nHowever, on Windows Workstations with the Hyper-V feature installed, this user right\nshould also be granted to the special group NT VIRTUAL MACHINE\\Virtual Machines\n- otherwise you will not be able to create new virtual machines.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 95",
    "remediation_procedure": "To implement the recommended configuration state, configure the following UI path to\nAdministrators and (when the Hyper-V feature is installed) NT VIRTUAL\nMACHINE\\Virtual Machines:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Create symbolic links",
    "default_value": "Administrators.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/create-symbolic-links\n2. GRID: MS-00000026\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 96",
    "page_number": 96
  },
  {
    "cis_id": "2.2.15",
    "title": "Ensure 'Debug programs' is set to 'Administrators'",
    "profile": "L1",
    "description": "This policy setting determines which user accounts will have the right to attach a\ndebugger to any process or to the kernel, which provides complete access to sensitive\nand critical operating system components. Developers who are debugging their own\napplications do not need to be assigned this user right; however, developers who are\ndebugging new system components will need it.\nThe recommended state for this setting is: Administrators.\nNote: This user right is considered a \"sensitive privilege\" for the purposes of auditing.",
    "rationale": "The Debug programs user right can be exploited to capture sensitive computer\ninformation from system memory, or to access and modify kernel or application\nstructures. Some attack tools exploit this user right to extract hashed passwords and\nother private security information, or to insert rootkit code. By default, the Debug\nprograms user right is assigned only to administrators, which helps to mitigate the risk\nfrom this vulnerability.",
    "impact": "If you revoke this user right, no one will be able to debug programs. However, typical\ncircumstances rarely require this capability on production computers. If a problem arises\nthat requires an application to be debugged on a production server, you can move the\nserver to a different OU temporarily and assign the Debug programs user right to a\nseparate Group Policy for that OU.\nThe service account that is used for the cluster service needs the Debug programs\nuser right; if it does not have it, Windows Clustering will fail.\nTools that are used to manage processes will be unable to affect processes that are not\nowned by the person who runs the tools. For example, the Windows Server 2003\nResource Kit tool Kill.exe requires this user right for administrators to terminate\nprocesses that they did not start.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 97",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAdministrators:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Debug programs",
    "default_value": "Administrators.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/debug-programs\n2. GRID: MS-00000027\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\n18.2 Ensure Explicit Error Checking is Performed for All In-\nhouse Developed Software\nv7 ● ●\nFor in-house developed software, ensure that explicit error checking is\nperformed and documented for all input, including for size, data type, and\nacceptable ranges or formats.\nPage 98",
    "page_number": 98
  },
  {
    "cis_id": "2.2.16",
    "title": "Ensure 'Deny access to this computer from the\nnetwork' to include 'Guests'",
    "profile": "L1",
    "description": "This policy setting prohibits users from connecting to a computer from across the\nnetwork, which would allow users to access and potentially modify data remotely. In\nhigh security environments, there should be no need for remote users to access data on\na computer. Instead, file sharing should be accomplished through the use of network\nservers. This user right supersedes the Access this computer from the network user\nright if an account is subject to both policies.\nThe recommended state for this setting is to include: Guests.\nCaution: Configuring a standalone (non-domain-joined) workstation as described above\nmay result in an inability to remotely administer the workstation.\nNote: The security identifier Local account is not available in Windows 7 and\nWindows 8.0 unless MSKB 2871997 has been installed.",
    "rationale": "Users who can log on to the computer over the network can enumerate lists of account\nnames, group names, and shared resources. Users with permission to access shared\nfolders and files can connect over the network and possibly view or modify data.",
    "impact": "If you configure the Deny access to this computer from the network user right for\nother groups, you could limit the abilities of users who are assigned to specific\nadministrative roles in your environment. You should verify that delegated tasks will not\nbe negatively affected.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 99",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to include\nGuests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Deny access to this computer from the network",
    "default_value": "Guest.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/deny-access-to-this-computer-from-the-network\n2. GRID: MS-00000028\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 100",
    "page_number": 100
  },
  {
    "cis_id": "2.2.17",
    "title": "Ensure 'Deny log on as a batch job' to include 'Guests'",
    "profile": "L1",
    "description": "This policy setting determines which accounts will not be able to log on to the computer\nas a batch job. A batch job is not a batch (.bat) file, but rather a batch-queue facility.\nAccounts that use the Task Scheduler to schedule jobs need this user right.\nThis user right supersedes the Log on as a batch job user right, which could be used\nto allow accounts to schedule jobs that consume excessive system resources. Such an\noccurrence could cause a DoS condition. Failure to assign this user right to the\nrecommended accounts can be a security risk.\nThe recommended state for this setting is to include: Guests.",
    "rationale": "Accounts that have the Log on as a batch job user right could be used to schedule\njobs that could consume excessive computer resources and cause a DoS condition.",
    "impact": "If you assign the Deny log on as a batch job user right to other accounts, you could\ndeny users who are assigned to specific administrative roles the ability to perform their\nrequired job activities. You should confirm that delegated tasks will not be affected\nadversely.\nFor example, if you assign this user right to the IWAM_(ComputerName) account, the\nMSM Management Point will fail. On a newly installed computer that runs Windows\nServer 2003 this account does not belong to the Guests group, but on a computer that\nwas upgraded from Windows 2000 this account is a member of the Guests group.\nTherefore, it is important that you understand which accounts belong to any groups that\nyou assign the Deny log on as a batch job user right.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 101",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to include\nGuests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Deny log on as a batch job",
    "default_value": "No one.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/deny-log-on-as-a-batch-job\n2. GRID: MS-00000029\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 102",
    "page_number": 102
  },
  {
    "cis_id": "2.2.18",
    "title": "Ensure 'Deny log on as a service' to include 'Guests'",
    "profile": "L1",
    "description": "This security setting determines which service accounts are prevented from registering\na process as a service. This user right supersedes the Log on as a service user right if\nan account is subject to both policies.\nThe recommended state for this setting is to include: Guests.\nNote: This security setting does not apply to the System, Local Service, or Network\nService accounts.",
    "rationale": "Accounts that can log on as a service could be used to configure and start new\nunauthorized services, such as a keylogger or other malicious software. The benefit of\nthe specified countermeasure is somewhat reduced by the fact that only users with\nadministrative privileges can install and configure services, and an attacker who has\nalready attained that level of access could configure the service to run with the System\naccount.",
    "impact": "If you assign the Deny log on as a service user right to specific accounts, services\nmay not be able to start and a DoS condition could result.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to include\nGuests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Deny log on as a service",
    "default_value": "No one.\nPage 103\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/deny-log-on-as-a-service\n2. GRID: MS-00000030\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 104",
    "page_number": 104
  },
  {
    "cis_id": "2.2.19",
    "title": "Ensure 'Deny log on locally' to include 'Guests'",
    "profile": "L1",
    "description": "This security setting determines which users are prevented from logging on at the\ncomputer. This policy setting supersedes the Allow log on locally policy setting if an\naccount is subject to both policies.\nThe recommended state for this setting is to include: Guests.\nImportant: If you apply this security policy to the Everyone group, no one will be able to\nlog on locally.",
    "rationale": "Any account with the ability to log on locally could be used to log on at the console of\nthe computer. If this user right is not restricted to legitimate users who need to log on to\nthe console of the computer, unauthorized users might download and run malicious\nsoftware that elevates their privileges.",
    "impact": "If you assign the Deny log on locally user right to additional accounts, you could limit\nthe abilities of users who are assigned to specific roles in your environment. However,\nthis user right should explicitly be assigned to the ASPNET account on computers that\nrun IIS 6.0. You should confirm that delegated activities will not be adversely affected.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to include\nGuests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Deny log on locally",
    "default_value": "Guest.\nPage 105\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/deny-log-on-locally\n2. GRID: MS-00000031\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 106",
    "page_number": 106
  },
  {
    "cis_id": "2.2.20",
    "title": "Ensure 'Deny log on through Remote Desktop\nServices' to include 'Guests'",
    "profile": "L1",
    "description": "This policy setting determines whether users can log on as Remote Desktop clients.\nAfter the baseline workstation is joined to a domain environment, there is no need to\nuse local accounts to access the workstation from the network. Domain accounts can\naccess the workstation for administration and end-user processing. This user right\nsupersedes the Allow log on through Remote Desktop Services user right if an\naccount is subject to both policies.\nThe recommended state for this setting is to include: Guests.\nCaution: Configuring a standalone (non-domain-joined) workstation as described above\nmay result in an inability to remotely administer the workstation.\nNote: The security identifier Local account is not available in Windows 7 and\nWindows 8.0 unless MSKB 2871997 has been installed.\nNote #2: In all versions of Windows prior to Windows 7, Remote Desktop Services\nwas known as Terminal Services, so you should substitute the older term if comparing\nagainst an older OS.",
    "rationale": "Any account with the right to log on through Remote Desktop Services could be used to\nlog on to the remote console of the computer. If this user right is not restricted to\nlegitimate users who need to log on to the console of the computer, unauthorized users\nmight download and run malicious software that elevates their privileges.",
    "impact": "If you assign the Deny log on through Remote Desktop Services user right to other\ngroups, you could limit the abilities of users who are assigned to specific administrative\nroles in your environment. Accounts that have this user right will be unable to connect to\nthe computer through either Remote Desktop Services or Remote Assistance. You\nshould confirm that delegated tasks will not be negatively impacted.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nPage 107",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to include\nGuests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment\\Deny log on through Remote Desktop Services",
    "default_value": "No one.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/deny-log-on-through-remote-desktop-services\n2. GRID: MS-00000032\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\nPage 108",
    "page_number": 108
  }
]