[
  {
    "cis_id": "19.5.1.1",
    "title": "Ensure 'Turn off toast notifications on the lock\nscreen' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting turns off toast notifications on the lock screen.\nThe recommended state for this setting is Enabled.",
    "rationale": "While this feature can be handy for users, applications that provide toast notifications\nmight display sensitive personal or business data while the device is left unattended.",
    "impact": "Applications will not be able to raise toast notifications on the lock screen.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKU\\[USER\nSID]\\Software\\Policies\\Microsoft\\Windows\\CurrentVersion\\PushNotifications:NoT\noastApplicationNotificationOnLockScreen",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nUser Configuration\\Policies\\Administrative Templates\\Start Menu and\nTaskbar\\Notifications\\Turn off toast notifications on the lock screen\nNote: This Group Policy path may not exist by default. It is provided by the Group Policy\ntemplate WPN.admx/adml that is included with the Microsoft Windows 8.0 & Server 2012\n(non-R2) Administrative Templates (or newer).",
    "default_value": "Disabled. (Toast notifications on the lock screen are enabled and can be turned off by\nthe administrator or user.)\nReferences:\n1. GRID: MS-00000557\nPage 1249\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8 ● ●\nUninstall or disable unnecessary services on enterprise assets and software,\nsuch as an unused file sharing service, web application module, or service\nfunction.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\nPage 1250",
    "page_number": 1250
  }
]