[
  {
    "cis_id": "5.12",
    "title": "Ensure 'OpenSSH SSH Server (sshd)' is set to\n'Disabled' or 'Not Installed'",
    "profile": "L1",
    "description": "SSH protocol based service to provide secure encrypted communications between two\nuntrusted hosts over an insecure network.\nThe recommended state for this setting is: Disabled or Not Installed.\nNote: This service is not installed by default. It is supplied with Windows, but it is\ninstalled by enabling an optional Windows feature (OpenSSH Server).",
    "rationale": "Hosting an SSH server from a workstation is an increased security risk, as the attack\nsurface of that workstation is then greatly increased.\nNote: This security concern applies to any SSH server application installed on a\nworkstation, not just the one supplied with Windows.",
    "impact": "The workstation will not be permitted to be a SSH host server.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4 or that the key does not exist.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\sshd:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command or\nensure the service is not installed.\nSet-Service -Name sshd -StartupType Disabled",
    "default_value": "Not Installed (Manual when installed)\nReferences:\n1. GRID: MS-00000140\nPage 306\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 307",
    "page_number": 307
  }
]