[
  {
    "cis_id": "5.28",
    "title": "Ensure 'Web Management Service (WMSvc)' is set to\n'Disabled' or 'Not Installed'",
    "profile": "L1",
    "description": "The Web Management Service enables remote and delegated management capabilities\nfor administrators to manage for the Web server, sites and applications present on the\nmachine.\nThe recommended state for this setting is: Disabled or Not Installed.\nNote: This service is not installed by default. It is supplied with Windows, but is installed\nby enabling an optional Windows feature (Internet Information Services - Web\nManagement Tools - IIS Management Service).",
    "rationale": "Remote web administration of IIS on a workstation is an increased security risk, as the\nattack surface of that workstation is then greatly increased. If proper security mitigations\nare not followed, the chance of successful attack increases significantly.",
    "impact": "Remote web-based management of IIS will not be available.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4 or that the key does not exist.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\WMSvc:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command or\nensure the service is not installed.\nSet-Service -Name WMSvc -StartupType Disabled",
    "default_value": "Not Installed (Manual when installed)\nReferences:\n1. GRID: MS-00000160\nPage 338\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 339",
    "page_number": 339
  }
]