[
  {
    "cis_id": "2.3.11.7",
    "title": "Ensure 'Network security: LAN Manager\nauthentication level' is set to 'Send NTLMv2 response only.\nRefuse LM & NTLM'",
    "profile": "L1",
    "description": "LAN Manager (LM) was a family of early Microsoft client/server software (predating\nWindows NT) that allowed users to link personal computers together on a single\nnetwork. LM network capabilities included transparent file and print sharing, user\nsecurity features, and network administration tools. In Active Directory domains, the\nKerberos protocol is the default authentication protocol. However, if the Kerberos\nprotocol is not negotiated for some reason, Active Directory will use LM, NTLM, or\nNTLMv2. LAN Manager authentication includes the LM, NTLM, and NTLM version 2\n(NTLMv2) variants, and is the protocol that is used to authenticate all Windows clients\nwhen they perform the following operations:\n• Join a domain\n• Authenticate between Active Directory forests\n• Authenticate to down-level domains\n• Authenticate to computers that do not run Windows 2000, Windows Server 2003,\nor Windows XP\n• Authenticate to computers that are not in the domain\nThe Network security: LAN Manager authentication level setting determines which\nchallenge/response authentication protocol is used for network logons. This choice\naffects the level of authentication protocol used by clients, the level of session security\nnegotiated, and the level of authentication accepted by servers.\nThe recommended state for this setting is: Send NTLMv2 response only. Refuse LM\n& NTLM.\nPage 243",
    "rationale": "Windows 2000 and Windows XP clients were configured by default to send LM and\nNTLM authentication responses (Windows 95-based and Windows 98-based clients\nonly send LM). The default settings in OSes predating Windows Vista / Windows Server\n2008 (non-R2) allowed all clients to authenticate with servers and use their resources.\nHowever, this meant that LM responses - the weakest form of authentication response -\nwere sent over the network, and it was potentially possible for attackers to sniff that\ntraffic to more easily reproduce the user's password.\nThe Windows 95, Windows 98, and Windows NT operating systems cannot use the\nKerberos version 5 protocol for authentication. For this reason, in a Windows Server\n2003 domain, these computers authenticate by default with both the LM and NTLM\nprotocols for network authentication. You can enforce a more secure authentication\nprotocol for Windows 95, Windows 98, and Windows NT by using NTLMv2. For the\nlogon process, NTLMv2 uses a secure channel to protect the authentication process.\nEven if you use NTLMv2 for older clients and servers, Windows-based clients and\nservers that are members of the domain will use the Kerberos authentication protocol to\nauthenticate with Windows Server 2003 or newer Domain Controllers. For these\nreasons, it is strongly preferred to restrict the use of LM & NTLM (non-v2) as much as\npossible.",
    "impact": "Clients use NTLMv2 authentication only and use NTLMv2 session security if the server\nsupports it; Domain Controllers refuse LM and NTLM (accept only NTLMv2\nauthentication). Clients that do not support NTLMv2 authentication will not be able to\nauthenticate in the domain and access domain resources by using LM and NTLM.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 5.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:LmCompatibilityLevel",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to: Send\nNTLMv2 response only. Refuse LM & NTLM:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: LAN Manager authentication level",
    "default_value": "Send NTLMv2 response only. (Clients use NTLMv2 authentication only and use\nNTLMv2 session security if the server supports it; Domain Controllers accept LM, NTLM\n& NTLMv2 authentication.)\nPage 244\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-lan-manager-authentication-level\n2. GRID: MS-00000109\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n9.2 Ensure Only Approved Ports, Protocols and\nServices Are Running\nv7 ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 245",
    "page_number": 244
  },
  {
    "cis_id": "2.3.11.8",
    "title": "Ensure 'Network security: LDAP client encryption\nrequirements' is set to 'Negotiate sealing' or higher",
    "profile": "L1",
    "description": "This policy setting determines the level of data encryption that is requested on behalf of\nclients that issue LDAP BIND requests.\nThe recommended state for this setting is: Negotiate sealing. Configuring this setting\nto Require sealing also conforms to the Benchmark.\nNote: This policy setting does not have any impact on LDAP simple bind\n(ldap_simple_bind) or LDAP simple bind through SSL (ldap_simple_bind_s).",
    "rationale": "Unencrypted network traffic is susceptible to man-in-the-middle attacks in which an\nintruder captures the packets between the client and server, modifies them, and then\nforwards them to the server. For an LDAP server, this susceptibility means that an\nattacker could cause a server to make decisions that are based on false or altered data\nfrom the LDAP queries. To lower this risk in your network, you can implement strong\nphysical security measures to protect the network infrastructure. Also, you can make all\ntypes of man-in-the-middle attacks extremely difficult if you require encryption on all\nnetwork packets by means of IPsec authentication headers.",
    "impact": "None - this is the default behavior.\nHowever, if this setting is configured to require LDAP encryption on the server, then it\nmust also be configured to require on the client. If it is not configured on the client, it will\nnot be able to communicate with the server, which could cause features to fail, including\nuser authentication, Group Policy, and logon scripts. This is because the caller will be\ntold that the LDAP BIND command request failed.\nPage 246",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LDAP:LDAPClientConfidentiality",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nNegotiate sealing or higher:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: LDAP client encryption\nrequirements",
    "default_value": "Enabled: Negotiate encryption (sealing).\nReferences:\n1. GRID: MS-00000572\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 247",
    "page_number": 247
  },
  {
    "cis_id": "2.3.11.9",
    "title": "Ensure 'Network security: LDAP client signing\nrequirements' is set to 'Negotiate signing' or higher",
    "profile": "L1",
    "description": "This policy setting determines the level of data signing that is requested on behalf of\nclients that issue LDAP BIND requests.\nNote: This policy setting does not have any impact on LDAP simple bind\n(ldap_simple_bind) or LDAP simple bind through SSL (ldap_simple_bind_s). No\nMicrosoft LDAP clients that are included with Windows XP Professional use\nldap_simple_bind or ldap_simple_bind_s to communicate with a Domain Controller.\nThe recommended state for this setting is: Negotiate signing. Configuring this setting\nto Require signing also conforms to the Benchmark.",
    "rationale": "Unsigned network traffic is susceptible to man-in-the-middle attacks in which an intruder\ncaptures the packets between the client and server, modifies them, and then forwards\nthem to the server. For an LDAP server, this susceptibility means that an attacker could\ncause a server to make decisions that are based on false or altered data from the LDAP\nqueries. To lower this risk in your network, you can implement strong physical security\nmeasures to protect the network infrastructure. Also, you can make all types of man-in-\nthe-middle attacks extremely difficult if you require digital signatures on all network\npackets by means of IPsec authentication headers.",
    "impact": "None - this is the default behavior. However, if you choose instead to configure the\nserver to require LDAP signatures then you must also configure the client. If you do not\nconfigure the client it will not be able to communicate with the server, which could cause\nmany features to fail, including user authentication, Group Policy, and logon scripts,\nbecause the caller will be told that the LDAP BIND command request failed.\nPage 248",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\LDAP:LDAPClientIntegrity",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nNegotiate signing (configuring to Require signing also conforms to the\nbenchmark):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: LDAP client signing requirements",
    "default_value": "Negotiate signing. (If Transport Layer Security/Secure Sockets Layer (TLS/SSL) has not\nbeen started, the LDAP BIND request is initiated with the LDAP data signing option set\nin addition to the caller-specified options. If TLS/SSL has been started, the LDAP BIND\nrequest is initiated with the caller-specified options.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-ldap-client-signing-requirements\n2. GRID: MS-00000110\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n12.5 Configure Monitoring Systems to Record Network\nPackets\nv7 ● ●\nConfigure monitoring systems to record network packets passing through\nthe boundary at each of the organization's network boundaries.\nPage 249",
    "page_number": 249
  },
  {
    "cis_id": "2.3.11.10",
    "title": "Ensure 'Network security: Minimum session\nsecurity for NTLM SSP based (including secure RPC) clients' is\nset to 'Require NTLMv2 session security, Require 128-bit\nencryption'",
    "profile": "L1",
    "description": "This policy setting determines which behaviors are allowed by clients for applications\nusing the NTLM Security Support Provider (SSP). The SSP Interface (SSPI) is used by\napplications that need authentication services. The setting does not modify how the\nauthentication sequence works but instead require certain behaviors in applications that\nuse the SSPI.\nThe recommended state for this setting is: Require NTLMv2 session security,\nRequire 128-bit encryption.\nNote: These values are dependent on the Network security: LAN Manager\nAuthentication Level (Rule 2.3.11.7) security setting value.",
    "rationale": "You can enable both options for this policy setting to help protect network traffic that\nuses the NTLM Security Support Provider (NTLM SSP) from being exposed or\ntampered with by an attacker who has gained access to the same network. In other\nwords, these options help protect against man-in-the-middle attacks.",
    "impact": "NTLM connections will fail if NTLMv2 protocol and strong encryption (128-bit) are not\nboth negotiated. Client applications that are enforcing these settings will be unable to\ncommunicate with older servers that do not support them.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 537395200.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:NTLMMinClientSec\nPage 250",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nRequire NTLMv2 session security, Require 128-bit encryption:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Minimum session security for NTLM\nSSP based (including secure RPC) clients",
    "default_value": "Require 128-bit encryption. (NTLM connections will fail if strong encryption (128-bit) is\nnot negotiated.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-minimum-session-security-for-ntlm-ssp-based-\nincluding-secure-rpc-clients\n2. GRID: MS-00000111\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n12.5 Configure Monitoring Systems to Record Network\nPackets\nv7 ● ●\nConfigure monitoring systems to record network packets passing through\nthe boundary at each of the organization's network boundaries.\nPage 251",
    "page_number": 251
  },
  {
    "cis_id": "2.3.11.11",
    "title": "Ensure 'Network security: Minimum session\nsecurity for NTLM SSP based (including secure RPC) servers' is\nset to 'Require NTLMv2 session security, Require 128-bit\nencryption'",
    "profile": "L1",
    "description": "This policy setting determines which behaviors are allowed by servers for applications\nusing the NTLM Security Support Provider (SSP). The SSP Interface (SSPI) is used by\napplications that need authentication services. The setting does not modify how the\nauthentication sequence works but instead require certain behaviors in applications that\nuse the SSPI.\nThe recommended state for this setting is: Require NTLMv2 session security,\nRequire 128-bit encryption.\nNote: These values are dependent on the Network security: LAN Manager\nAuthentication Level (Rule 2.3.11.7) security setting value.",
    "rationale": "You can enable all of the options for this policy setting to help protect network traffic that\nuses the NTLM Security Support Provider (NTLM SSP) from being exposed or\ntampered with by an attacker who has gained access to the same network. That is,\nthese options help protect against man-in-the-middle attacks.",
    "impact": "NTLM connections will fail if NTLMv2 protocol and strong encryption (128-bit) are not\nboth negotiated. Server applications that are enforcing these settings will be unable to\ncommunicate with older servers that do not support them.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 537395200.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:NTLMMinServerSec\nPage 252",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nRequire NTLMv2 session security, Require 128-bit encryption:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Minimum session security for NTLM\nSSP based (including secure RPC) servers",
    "default_value": "Require 128-bit encryption. (NTLM connections will fail if strong encryption (128-bit) is\nnot negotiated.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-minimum-session-security-for-ntlm-ssp-based-\nincluding-secure-rpc-servers\n2. GRID: MS-00000112\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n12.5 Configure Monitoring Systems to Record Network\nPackets\nv7 ● ●\nConfigure monitoring systems to record network packets passing through\nthe boundary at each of the organization's network boundaries.\nPage 253",
    "page_number": 253
  },
  {
    "cis_id": "2.3.11.12",
    "title": "Ensure 'Network security: Restrict NTLM: Audit\nIncoming NTLM Traffic' is set to 'Enable auditing for all accounts'",
    "profile": "L1",
    "description": "This policy setting allows the auditing of incoming NTLM traffic. Events for this setting\nare recorded in the operational event log (e.g. Applications and Services\nLog\\Microsoft\\Windows\\NTLM).\nThe recommended state for this setting is: Enable auditing for all accounts.",
    "rationale": "Auditing and monitoring NTLM traffic can assist in identifying systems using this\noutdated authentication protocol, so they can be remediated to using a more secure\nprotocol, such as Kerberos. The log information gathered can also assist in forensic\ninvestigations after a malicious attack.\nNTLM and NTLMv2 authentication is vulnerable to various attacks, including SMB relay,\nman-in-the-middle, and brute force attacks. Reducing and eliminating NTLM\nauthentication in an environment reduces the risk of an attacker gaining access to\nsystems on the network.",
    "impact": "The event log will contain information on incoming NTLM authentication traffic.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 2.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:AuditReceivingNTLMTraffic\nPage 254",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Enable\nauditing for all accounts:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Restrict NTLM: Audit Incoming\nNTLM Traffic",
    "default_value": "Disabled. (Incoming NTLM traffic is not logged.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-restrict-ntlm-audit-incoming-ntlm-traffic\n2. https://learn.microsoft.com/en-us/defender-for-identity/configure-windows-event-\ncollection#event-id-8004\n3. GRID: MS-00000113\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\nPage 255",
    "page_number": 255
  },
  {
    "cis_id": "2.3.11.13",
    "title": "Ensure 'Network security: Restrict NTLM: Outgoing\nNTLM traffic to remote servers' is set to 'Audit all' or higher",
    "profile": "L1",
    "description": "This policy setting allows the auditing of outgoing NTLM traffic. Events for this setting\nare recorded in the operational event log (e.g. Applications and Services\nLog\\Microsoft\\Windows\\NTLM).\nThe recommended state for this setting is: Audit all. Configuring this setting to Deny\nAll also conforms to the benchmark.\nNote: Configuring this setting to Deny All is more secure, however it could have a\nnegative impact on applications that still require NTLM. Test carefully before\nimplementing the Deny All value.",
    "rationale": "Auditing and monitoring NTLM traffic can assist in identifying systems using this\noutdated authentication protocol, so they can be remediated to using a more secure\nprotocol, such as Kerberos. The log information gathered can also assist in forensic\ninvestigations after a malicious attack.\nNTLM and NTLMv2 authentication is vulnerable to various attacks, including SMB relay,\nman-in-the-middle, and brute force attacks. Reducing and eliminating NTLM\nauthentication in an environment reduces the risk of an attacker gaining access to\nsystems on the network.",
    "impact": "The event log will contain information on outgoing NTLM authentication traffic.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:RestrictSendingNTLMTraffic\nPage 256",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Audit\nall or higher:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Restrict NTLM: Outgoing NTLM\ntraffic to remote servers",
    "default_value": "Allow all. (The client can authenticate to remote servers by using NTLM authentication.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-restrict-ntlm-audit-incoming-ntlm-traffic\n2. https://learn.microsoft.com/en-us/defender-for-identity/configure-windows-event-\ncollection#event-id-8004\n3. GRID: MS-00000115\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\n2.3.12 Recovery console\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\n2.3.13 Shutdown\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 257",
    "page_number": 257
  },
  {
    "cis_id": "2.3.14.1",
    "title": "Ensure 'System cryptography: Force strong key\nprotection for user keys stored on the computer' is set to 'User is\nprompted when the key is first used' or higher",
    "profile": "L2",
    "description": "This policy setting determines whether users' private keys (such as their S-MIME keys)\nrequire a password to be used.\nThe recommended state for this setting is: User is prompted when the key is\nfirst used. Configuring this setting to User must enter a password each time\nthey use a key also conforms to the benchmark.",
    "rationale": "If a user's account is compromised or their computer is inadvertently left unsecured the\nmalicious user can use the keys stored for the user to access protected resources. You\ncan configure this policy setting so that users must provide a password that is distinct\nfrom their domain password every time they use a key. This configuration makes it more\ndifficult for an attacker to access locally stored user keys, even if the attacker takes\ncontrol of the user's computer and determines their logon password.",
    "impact": "Users will have to enter their password the first time they access a key that is stored on\ntheir computer. For example, if users use an S-MIME certificate to digitally sign their e-\nmail they will be forced to enter the password for that certificate the first time that they\nsend a signed e-mail message. For even stronger security, the value User must enter\na password each time they use a key can be set, but the overhead that is\ninvolved using this configuration may be too high for some organizations.\nMicrosoft does not recommend enforcing this setting on servers due to the significant\nimpact on manageability. For example, you may not be able to configure Remote\nDesktop Services to use SSL certificates. More information is available in the Windows\nPKI TechNet Blog here: What is a strong key protection in Windows?.\nPage 259",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\Cryptography:ForceKeyProtection",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to User\nis prompted when the key is first used or User must enter a password\neach time they use a key:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System cryptography: Force strong key protection\nfor user keys stored on the computer",
    "default_value": "User input is not required when new keys are stored and used.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-cryptography-force-strong-key-protection-for-user-keys-\nstored-on-the-computer\n2. GRID: MS-00000117\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.11 Encrypt Sensitive Data at Rest\nEncrypt sensitive data at rest on servers, applications, and databases containing\nv8 sensitive data. Storage-layer encryption, also known as server-side encryption, ● ●\nmeets the minimum requirement of this Safeguard. Additional encryption methods\nmay include application-layer encryption, also known as client-side encryption,\nwhere access to the data storage device(s) does not permit access to the plain-text\ndata.\n16.4 Encrypt or Hash all Authentication Credentials\nv7 ● ●\nEncrypt or hash with a salt all authentication credentials when stored.\nPage 260",
    "page_number": 260
  },
  {
    "cis_id": "2.3.15.1",
    "title": "Ensure 'System objects: Require case insensitivity\nfor non-Windows subsystems' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether case insensitivity is enforced for all subsystems.\nThe Microsoft Win32 subsystem is case insensitive. However, the kernel supports case\nsensitivity for other subsystems, such as the Portable Operating System Interface for\nUNIX (POSIX). Because Windows is case insensitive (but the POSIX subsystem will\nsupport case sensitivity), failure to enforce this policy setting makes it possible for a\nuser of the POSIX subsystem to create a file with the same name as another file by\nusing mixed case to label it. Such a situation can block access to these files by another\nuser who uses typical Win32 tools, because only one of the files will be available.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Because Windows is case-insensitive but the POSIX subsystem will support case\nsensitivity, failure to enable this policy setting would make it possible for a user of that\nsubsystem to create a file with the same name as another file but with a different mix of\nupper and lower case letters. Such a situation could potentially confuse users when\nthey try to access such files from normal Win32 tools because only one of the files will\nbe available.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Session\nManager\\Kernel:ObCaseInsensitive\nPage 262",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System objects: Require case insensitivity for non-\nWindows subsystems",
    "default_value": "Enabled. (All subsystems will be forced to observe case insensitivity. This configuration\nmay confuse users who are familiar with any UNIX-based operating systems that is\ncase-sensitive.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-objects-require-case-insensitivity-for-non-windows-\nsubsystems\n2. GRID: MS-00000118\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 263",
    "page_number": 263
  },
  {
    "cis_id": "2.3.15.2",
    "title": "Ensure 'System objects: Strengthen default\npermissions of internal system objects (e.g. Symbolic Links)' is\nset to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines the strength of the default discretionary access control list\n(DACL) for objects. Active Directory maintains a global list of shared system resources,\nsuch as DOS device names, mutexes, and semaphores. In this way, objects can be\nlocated and shared among processes. Each type of object is created with a default\nDACL that specifies who can access the objects and what permissions are granted.\nThe recommended state for this setting is: Enabled.",
    "rationale": "This setting determines the strength of the default DACL for objects. Windows maintains\na global list of shared computer resources so that objects can be located and shared\namong processes. Each type of object is created with a default DACL that specifies who\ncan access the objects and with what permissions.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager:ProtectionMode\nPage 264",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System objects: Strengthen default permissions of\ninternal system objects (e.g. Symbolic Links)",
    "default_value": "Enabled. (The default DACL is stronger, allowing users who are not administrators to\nread shared objects but not allowing these users to modify shared objects that they did\nnot create.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-objects-strengthen-default-permissions-of-internal-system-\nobjects\n2. GRID: MS-00000119\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.1 Establish and Maintain a Secure Configuration Process\nEstablish and maintain a secure configuration process for enterprise assets\nv8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ●\nservers) and software (operating systems and applications). Review and update\ndocumentation annually, or when significant enterprise changes occur that could\nimpact this Safeguard.\n5.1 Establish Secure Configurations\nv7 ● ● ●\nMaintain documented, standard security configuration standards for all\nauthorized operating systems and software.\n2.3.16 System settings\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 265",
    "page_number": 265
  }
]