[
  {
    "cis_id": "17.8.1",
    "title": "Ensure 'Audit Sensitive Privilege Use' is set to\n'Success and Failure'",
    "profile": "L1",
    "description": "This subcategory reports when a user account or service uses a sensitive privilege. A\nsensitive privilege includes the following user rights:\n• Act as part of the operating system\n• Back up files and directories\n• Create a token object\n• Debug programs\n• Enable computer and user accounts to be trusted for delegation\n• Generate security audits\n• Impersonate a client after authentication\n• Load and unload device drivers\n• Manage auditing and security log\n• Modify firmware environment values\n• Replace a process-level token\n• Restore files and directories\n• Take ownership of files or other objects\nAuditing this subcategory will create a high volume of events. Events for this\nsubcategory include:\n• 4672: Special privileges assigned to new logon.\n• 4673: A privileged service was called.\n• 4674: An operation was attempted on a privileged object.\nThe recommended state for this setting is: Success and Failure.",
    "rationale": "Auditing these events may be useful when investigating a security incident.\nPage 458",
    "impact": "If no audit settings are configured, or if audit settings are too lax on the computers in\nyour organization, security incidents might not be detected, or not enough evidence will\nbe available for network forensic analysis after security incidents occur. However, if\naudit settings are too severe, critically important entries in the Security log may be\nobscured by all of the meaningless entries and computer performance and the available\namount of data storage may be seriously affected. Companies that operate in certain\nregulated industries may have legal obligations to log certain events or activities.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nOR\nTo audit the system using auditpol.exe, perform the following and confirm it is set as\nprescribed:\nauditpol /get /subcategory:\"{0cce9228-69ae-11d9-bed3-505054503030}\"",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nSuccess and Failure:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Advanced\nAudit Policy Configuration\\Audit Policies\\Privilege Use\\Audit Sensitive\nPrivilege Use",
    "default_value": "No Auditing.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-\nprotection/auditing/audit-sensitive-privilege-use\n2. GRID: MS-00000224\nPage 459\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\nPage 460",
    "page_number": 459
  }
]