[
  {
    "cis_id": "5.2",
    "title": "Ensure 'Bluetooth Support Service (bthserv)' is set to\n'Disabled'",
    "profile": "L2",
    "description": "The Bluetooth service supports discovery and association of remote Bluetooth devices.\nThe recommended state for this setting is: Disabled.",
    "rationale": "Bluetooth technology has inherent security risks - especially prior to the v2.1 standard.\nWireless Bluetooth traffic is not well encrypted (if at all), so in a high-security\nenvironment, it should not be permitted, in spite of the added inconvenience of not\nbeing able to use Bluetooth devices.",
    "impact": "Already installed Bluetooth devices may fail to operate properly and new devices may\nbe prevented from being discovered or associated. If Bluetooth devices were installed,\nthen some Windows components, such as Devices and Printers, may fail to operate\ncorrectly - including hanging/freezing when opened. The solution, besides re-enabling\nthis service, is to disable or delete the offending Bluetooth device(s) in Device Manager,\nor disable the device altogether via the system BIOS (if it is an on-board Bluetooth\ndevice).",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 4.\nHKLM\\SYSTEM\\CurrentControlSet\\Services\\bthserv:Start",
    "remediation_procedure": "To establish the recommended configuration, run the following PowerShell command:\nSet-Service -Name bthserv -StartupType Disabled",
    "default_value": "Windows 7: Manual\nWindows 8.0 or newer: Manual (Trigger Start)\nPage 286\nReferences:\n1. GRID: MS-00000129\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.8 Uninstall or Disable Unnecessary Services on\nEnterprise Assets and Software\nv8\nUninstall or disable unnecessary services on enterprise assets and software,\n● ●\nsuch as an unused file sharing service, web application module, or service\nfunction.\n9.2 Ensure Only Approved Ports, Protocols and Services\nv7 Are Running ● ●\nEnsure that only network ports, protocols, and services listening on a system\nwith validated business needs, are running on each system.\nPage 287",
    "page_number": 287
  }
]