[
  {
    "cis_id": "2.3.11.11",
    "title": "Ensure 'Network security: Minimum session\nsecurity for NTLM SSP based (including secure RPC) servers' is\nset to 'Require NTLMv2 session security, Require 128-bit\nencryption'",
    "profile": "L1",
    "description": "This policy setting determines which behaviors are allowed by servers for applications\nusing the NTLM Security Support Provider (SSP). The SSP Interface (SSPI) is used by\napplications that need authentication services. The setting does not modify how the\nauthentication sequence works but instead require certain behaviors in applications that\nuse the SSPI.\nThe recommended state for this setting is: Require NTLMv2 session security,\nRequire 128-bit encryption.\nNote: These values are dependent on the Network security: LAN Manager\nAuthentication Level (Rule 2.3.11.7) security setting value.",
    "rationale": "You can enable all of the options for this policy setting to help protect network traffic that\nuses the NTLM Security Support Provider (NTLM SSP) from being exposed or\ntampered with by an attacker who has gained access to the same network. That is,\nthese options help protect against man-in-the-middle attacks.",
    "impact": "NTLM connections will fail if NTLMv2 protocol and strong encryption (128-bit) are not\nboth negotiated. Server applications that are enforcing these settings will be unable to\ncommunicate with older servers that do not support them.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 537395200.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:NTLMMinServerSec\nPage 252",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nRequire NTLMv2 session security, Require 128-bit encryption:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Minimum session security for NTLM\nSSP based (including secure RPC) servers",
    "default_value": "Require 128-bit encryption. (NTLM connections will fail if strong encryption (128-bit) is\nnot negotiated.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-minimum-session-security-for-ntlm-ssp-based-\nincluding-secure-rpc-servers\n2. GRID: MS-00000112\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.10 Encrypt Sensitive Data in Transit\nv8 ● ●\nEncrypt sensitive data in transit. Example implementations can include:\nTransport Layer Security (TLS) and Open Secure Shell (OpenSSH).\n12.5 Configure Monitoring Systems to Record Network\nPackets\nv7 ● ●\nConfigure monitoring systems to record network packets passing through\nthe boundary at each of the organization's network boundaries.\nPage 253",
    "page_number": 253
  },
  {
    "cis_id": "2.3.11.12",
    "title": "Ensure 'Network security: Restrict NTLM: Audit\nIncoming NTLM Traffic' is set to 'Enable auditing for all accounts'",
    "profile": "L1",
    "description": "This policy setting allows the auditing of incoming NTLM traffic. Events for this setting\nare recorded in the operational event log (e.g. Applications and Services\nLog\\Microsoft\\Windows\\NTLM).\nThe recommended state for this setting is: Enable auditing for all accounts.",
    "rationale": "Auditing and monitoring NTLM traffic can assist in identifying systems using this\noutdated authentication protocol, so they can be remediated to using a more secure\nprotocol, such as Kerberos. The log information gathered can also assist in forensic\ninvestigations after a malicious attack.\nNTLM and NTLMv2 authentication is vulnerable to various attacks, including SMB relay,\nman-in-the-middle, and brute force attacks. Reducing and eliminating NTLM\nauthentication in an environment reduces the risk of an attacker gaining access to\nsystems on the network.",
    "impact": "The event log will contain information on incoming NTLM authentication traffic.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 2.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:AuditReceivingNTLMTraffic\nPage 254",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Enable\nauditing for all accounts:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Restrict NTLM: Audit Incoming\nNTLM Traffic",
    "default_value": "Disabled. (Incoming NTLM traffic is not logged.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-restrict-ntlm-audit-incoming-ntlm-traffic\n2. https://learn.microsoft.com/en-us/defender-for-identity/configure-windows-event-\ncollection#event-id-8004\n3. GRID: MS-00000113\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\nPage 255",
    "page_number": 255
  },
  {
    "cis_id": "2.3.11.13",
    "title": "Ensure 'Network security: Restrict NTLM: Outgoing\nNTLM traffic to remote servers' is set to 'Audit all' or higher",
    "profile": "L1",
    "description": "This policy setting allows the auditing of outgoing NTLM traffic. Events for this setting\nare recorded in the operational event log (e.g. Applications and Services\nLog\\Microsoft\\Windows\\NTLM).\nThe recommended state for this setting is: Audit all. Configuring this setting to Deny\nAll also conforms to the benchmark.\nNote: Configuring this setting to Deny All is more secure, however it could have a\nnegative impact on applications that still require NTLM. Test carefully before\nimplementing the Deny All value.",
    "rationale": "Auditing and monitoring NTLM traffic can assist in identifying systems using this\noutdated authentication protocol, so they can be remediated to using a more secure\nprotocol, such as Kerberos. The log information gathered can also assist in forensic\ninvestigations after a malicious attack.\nNTLM and NTLMv2 authentication is vulnerable to various attacks, including SMB relay,\nman-in-the-middle, and brute force attacks. Reducing and eliminating NTLM\nauthentication in an environment reduces the risk of an attacker gaining access to\nsystems on the network.",
    "impact": "The event log will contain information on outgoing NTLM authentication traffic.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa\\MSV1_0:RestrictSendingNTLMTraffic\nPage 256",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Audit\nall or higher:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Network security: Restrict NTLM: Outgoing NTLM\ntraffic to remote servers",
    "default_value": "Allow all. (The client can authenticate to remote servers by using NTLM authentication.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/network-security-restrict-ntlm-audit-incoming-ntlm-traffic\n2. https://learn.microsoft.com/en-us/defender-for-identity/configure-windows-event-\ncollection#event-id-8004\n3. GRID: MS-00000115\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\n2.3.12 Recovery console\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\n2.3.13 Shutdown\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 257",
    "page_number": 257
  },
  {
    "cis_id": "2.3.14.1",
    "title": "Ensure 'System cryptography: Force strong key\nprotection for user keys stored on the computer' is set to 'User is\nprompted when the key is first used' or higher",
    "profile": "L2",
    "description": "This policy setting determines whether users' private keys (such as their S-MIME keys)\nrequire a password to be used.\nThe recommended state for this setting is: User is prompted when the key is\nfirst used. Configuring this setting to User must enter a password each time\nthey use a key also conforms to the benchmark.",
    "rationale": "If a user's account is compromised or their computer is inadvertently left unsecured the\nmalicious user can use the keys stored for the user to access protected resources. You\ncan configure this policy setting so that users must provide a password that is distinct\nfrom their domain password every time they use a key. This configuration makes it more\ndifficult for an attacker to access locally stored user keys, even if the attacker takes\ncontrol of the user's computer and determines their logon password.",
    "impact": "Users will have to enter their password the first time they access a key that is stored on\ntheir computer. For example, if users use an S-MIME certificate to digitally sign their e-\nmail they will be forced to enter the password for that certificate the first time that they\nsend a signed e-mail message. For even stronger security, the value User must enter\na password each time they use a key can be set, but the overhead that is\ninvolved using this configuration may be too high for some organizations.\nMicrosoft does not recommend enforcing this setting on servers due to the significant\nimpact on manageability. For example, you may not be able to configure Remote\nDesktop Services to use SSL certificates. More information is available in the Windows\nPKI TechNet Blog here: What is a strong key protection in Windows?.\nPage 259",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SOFTWARE\\Policies\\Microsoft\\Cryptography:ForceKeyProtection",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to User\nis prompted when the key is first used or User must enter a password\neach time they use a key:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System cryptography: Force strong key protection\nfor user keys stored on the computer",
    "default_value": "User input is not required when new keys are stored and used.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-cryptography-force-strong-key-protection-for-user-keys-\nstored-on-the-computer\n2. GRID: MS-00000117\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n3.11 Encrypt Sensitive Data at Rest\nEncrypt sensitive data at rest on servers, applications, and databases containing\nv8 sensitive data. Storage-layer encryption, also known as server-side encryption, ● ●\nmeets the minimum requirement of this Safeguard. Additional encryption methods\nmay include application-layer encryption, also known as client-side encryption,\nwhere access to the data storage device(s) does not permit access to the plain-text\ndata.\n16.4 Encrypt or Hash all Authentication Credentials\nv7 ● ●\nEncrypt or hash with a salt all authentication credentials when stored.\nPage 260",
    "page_number": 260
  },
  {
    "cis_id": "2.3.15.1",
    "title": "Ensure 'System objects: Require case insensitivity\nfor non-Windows subsystems' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether case insensitivity is enforced for all subsystems.\nThe Microsoft Win32 subsystem is case insensitive. However, the kernel supports case\nsensitivity for other subsystems, such as the Portable Operating System Interface for\nUNIX (POSIX). Because Windows is case insensitive (but the POSIX subsystem will\nsupport case sensitivity), failure to enforce this policy setting makes it possible for a\nuser of the POSIX subsystem to create a file with the same name as another file by\nusing mixed case to label it. Such a situation can block access to these files by another\nuser who uses typical Win32 tools, because only one of the files will be available.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Because Windows is case-insensitive but the POSIX subsystem will support case\nsensitivity, failure to enable this policy setting would make it possible for a user of that\nsubsystem to create a file with the same name as another file but with a different mix of\nupper and lower case letters. Such a situation could potentially confuse users when\nthey try to access such files from normal Win32 tools because only one of the files will\nbe available.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Session\nManager\\Kernel:ObCaseInsensitive\nPage 262",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System objects: Require case insensitivity for non-\nWindows subsystems",
    "default_value": "Enabled. (All subsystems will be forced to observe case insensitivity. This configuration\nmay confuse users who are familiar with any UNIX-based operating systems that is\ncase-sensitive.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-objects-require-case-insensitivity-for-non-windows-\nsubsystems\n2. GRID: MS-00000118\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 263",
    "page_number": 263
  },
  {
    "cis_id": "2.3.15.2",
    "title": "Ensure 'System objects: Strengthen default\npermissions of internal system objects (e.g. Symbolic Links)' is\nset to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines the strength of the default discretionary access control list\n(DACL) for objects. Active Directory maintains a global list of shared system resources,\nsuch as DOS device names, mutexes, and semaphores. In this way, objects can be\nlocated and shared among processes. Each type of object is created with a default\nDACL that specifies who can access the objects and what permissions are granted.\nThe recommended state for this setting is: Enabled.",
    "rationale": "This setting determines the strength of the default DACL for objects. Windows maintains\na global list of shared computer resources so that objects can be located and shared\namong processes. Each type of object is created with a default DACL that specifies who\ncan access the objects and with what permissions.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Session Manager:ProtectionMode\nPage 264",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\System objects: Strengthen default permissions of\ninternal system objects (e.g. Symbolic Links)",
    "default_value": "Enabled. (The default DACL is stronger, allowing users who are not administrators to\nread shared objects but not allowing these users to modify shared objects that they did\nnot create.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/system-objects-strengthen-default-permissions-of-internal-system-\nobjects\n2. GRID: MS-00000119\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.1 Establish and Maintain a Secure Configuration Process\nEstablish and maintain a secure configuration process for enterprise assets\nv8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ●\nservers) and software (operating systems and applications). Review and update\ndocumentation annually, or when significant enterprise changes occur that could\nimpact this Safeguard.\n5.1 Establish Secure Configurations\nv7 ● ● ●\nMaintain documented, standard security configuration standards for all\nauthorized operating systems and software.\n2.3.16 System settings\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 265",
    "page_number": 265
  },
  {
    "cis_id": "2.3.17.1",
    "title": "Ensure 'User Account Control: Admin Approval\nMode for the Built-in Administrator account' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of Admin Approval Mode for the built-in\nAdministrator account.\nThe recommended state for this setting is: Enabled.",
    "rationale": "One of the risks that the User Account Control feature introduced with Windows Vista is\ntrying to mitigate is that of malicious software running under elevated credentials without\nthe user or administrator being aware of its activity. An attack vector for these programs\nwas to discover the password of the account named \"Administrator\" because that user\naccount was created for all installations of Windows. To address this risk, in Windows\nVista or newer, the built-in Administrator account is now disabled by default. In a default\ninstallation of a new computer, accounts with administrative control over the computer\nare initially set up in one of two ways:\n• If the computer is not joined to a domain, the first user account you create has\nthe equivalent permissions as a local administrator.\n• If the computer is joined to a domain, no local administrator accounts are\ncreated. The Enterprise or Domain Administrator must log on to the computer\nand create one if a local administrator account is warranted.\nOnce Windows is installed, the built-in Administrator account may be manually enabled,\nbut we strongly recommend that this account remain disabled.",
    "impact": "The built-in Administrator account uses Admin Approval Mode. Users that log on using\nthe local Administrator account will be prompted for consent whenever a program\nrequests an elevation in privilege, just like any other user would.\nPage 267",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:FilterAdminist\nratorToken",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Admin Approval Mode for the\nBuilt-in Administrator account",
    "default_value": "Disabled. (The built-in Administrator account runs all applications with full administrative\nprivilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-admin-approval-mode-for-the-built-in-\nadministrator-account\n2. GRID: MS-00000120\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n4.4 Use Unique Passwords\nv7 Where multi-factor authentication is not supported (such as local ● ●\nadministrator, root, or service accounts), accounts will use passwords that are\nunique to that system.\nPage 268",
    "page_number": 268
  },
  {
    "cis_id": "2.3.17.2",
    "title": "Ensure 'User Account Control: Behavior of the\nelevation prompt for administrators in Admin Approval Mode' is\nset to 'Prompt for consent on the secure desktop' or higher",
    "profile": "L1",
    "description": "This policy setting controls the behavior of the elevation prompt for administrators.\nThe recommended state for this setting is: Prompt for consent on the secure\ndesktop. Configuring this setting to Prompt for credentials on the secure\ndesktop also conforms to the benchmark.",
    "rationale": "One of the risks that the UAC feature introduced with Windows Vista is trying to mitigate\nis that of malicious software running under elevated credentials without the user or\nadministrator being aware of its activity. This setting raises awareness to the\nadministrator of elevated privilege operations and permits the administrator to prevent a\nmalicious program from elevating its privilege when the program attempts to do so.",
    "impact": "When an operation (including execution of a Windows binary) requires elevation of\nprivilege, the user is prompted on the secure desktop to select either Permit or Deny. If\nthe user selects Permit, the operation continues with the user's highest available\nprivilege.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1 or 2.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:ConsentPromptB\nehaviorAdmin\nPage 269",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Prompt\nfor consent on the secure desktop or Prompt for credentials on the\nsecure desktop:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Behavior of the elevation\nprompt for administrators in Admin Approval Mode",
    "default_value": "Prompt for consent for non-Windows binaries. (When an operation for a non-Microsoft\napplication requires elevation of privilege, the user is prompted on the secure desktop to\nselect either Permit or Deny. If the user selects Permit, the operation continues with the\nuser's highest available privilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-behavior-of-the-elevation-prompt-for-\nadministrators-in-admin-approval-mode\n2. GRID: MS-00000121\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 270",
    "page_number": 270
  },
  {
    "cis_id": "2.3.17.3",
    "title": "Ensure 'User Account Control: Behavior of the\nelevation prompt for standard users' is set to 'Automatically deny\nelevation requests'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of the elevation prompt for standard users.\nThe recommended state for this setting is: Automatically deny elevation\nrequests.",
    "rationale": "One of the risks that the User Account Control feature introduced with Windows Vista is\ntrying to mitigate is that of malicious programs running under elevated credentials\nwithout the user or administrator being aware of their activity. This setting raises\nawareness to the user that a program requires the use of elevated privilege operations\nand requires that the user be able to supply administrative credentials in order for the\nprogram to run.",
    "impact": "When an operation requires elevation of privilege, a configurable access denied error\nmessage is displayed. An enterprise that is running desktops as standard user may\nchoose this setting to reduce help desk calls.\nNote: With this setting configured as recommended, the default error message\ndisplayed when a user attempts to perform an operation or run a program requiring\nprivilege elevation (without Administrator rights) is \"This program will not run. This\nprogram is blocked by group policy. For more information, contact your system\nadministrator.\" Some users who are not used to seeing this message may believe that\nthe operation or program they attempted to run is specifically blocked by group policy,\nas that is what the message seems to imply. This message may therefore result in user\nquestions as to why that specific operation/program is blocked, when in fact, the\nproblem is that they need to perform the operation or run the program with an\nAdministrative account (or \"Run as Administrator\" if it is already an Administrator\naccount), and they are not doing that.\nPage 271",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:ConsentPromptB\nehaviorUser",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nAutomatically deny elevation requests:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Behavior of the elevation\nprompt for standard users",
    "default_value": "Prompt for credentials. (When an operation requires elevation of privilege, the user is\nprompted to enter an administrative user name and password. If the user enters valid\ncredentials, the operation continues with the applicable privilege.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-behavior-of-the-elevation-prompt-for-\nstandard-users\n2. GRID: MS-00000122\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 272",
    "page_number": 272
  },
  {
    "cis_id": "2.3.17.4",
    "title": "Ensure 'User Account Control: Detect application\ninstallations and prompt for elevation' is set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting controls the behavior of application installation detection for the\ncomputer.\nThe recommended state for this setting is: Enabled.",
    "rationale": "Some malicious software will attempt to install itself after being given permission to run.\nFor example, malicious software with a trusted application shell. The user may have\ngiven permission for the program to run because the program is trusted, but if they are\nthen prompted for installation of an unknown component this provides another way of\ntrapping the software before it can do damage",
    "impact": "When an application installation package is detected that requires elevation of privilege,\nthe user is prompted to enter an administrative user name and password. If the user\nenters valid credentials, the operation continues with the applicable privilege.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:EnableInstalle\nrDetection\nPage 273",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\User Account Control: Detect application\ninstallations and prompt for elevation",
    "default_value": "Disabled. (Default for enterprise. Application installation packages are not detected and\nprompted for elevation.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/user-account-control-detect-application-installations-and-prompt-\nfor-elevation\n2. GRID: MS-00000123\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 274",
    "page_number": 274
  }
]