[
  {
    "cis_id": "17.1.1",
    "title": "Ensure 'Audit Credential Validation' is set to 'Success\nand Failure'",
    "profile": "L1",
    "description": "This subcategory reports the results of validation tests on credentials submitted for a\nuser account logon request. These events occur on the computer that is authoritative for\nthe credentials. For domain accounts, the Domain Controller is authoritative, whereas\nfor local accounts, the local computer is authoritative. In domain environments, most of\nthe Account Logon events occur in the Security log of the Domain Controllers that are\nauthoritative for the domain accounts. However, these events can occur on other\ncomputers in the organization when local accounts are used to log on. Events for this\nsubcategory include:\n• 4774: An account was mapped for logon.\n• 4775: An account could not be mapped for logon.\n• 4776: The Domain Controller attempted to validate the credentials for an\naccount.\n• 4777: The Domain Controller failed to validate the credentials for an account.\nThe recommended state for this setting is: Success and Failure.",
    "rationale": "Auditing these events may be useful when investigating a security incident.",
    "impact": "If no audit settings are configured, or if audit settings are too lax on the computers in\nyour organization, security incidents might not be detected, or not enough evidence will\nbe available for network forensic analysis after security incidents occur. However, if\naudit settings are too severe, critically important entries in the Security log may be\nobscured by all of the meaningless entries and computer performance and the available\namount of data storage may be seriously affected. Companies that operate in certain\nregulated industries may have legal obligations to log certain events or activities.\nPage 402",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.\nOR\nTo audit the system using auditpol.exe, perform the following and confirm it is set as\nprescribed:\nauditpol /get /subcategory:\"{0cce923f-69ae-11d9-bed3-505054503030}\"",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nSuccess and Failure:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Advanced\nAudit Policy Configuration\\Audit Policies\\Account Logon\\Audit Credential\nValidation",
    "default_value": "No Auditing.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-\nprotection/auditing/audit-credential-validation\n2. GRID: MS-00000196\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\nPage 403",
    "page_number": 403
  }
]