[
  {
    "cis_id": "2.3.1.2",
    "title": "Ensure 'Accounts: Limit local account use of blank\npasswords to console logon only' is set to 'Enabled'",
    "profile": "L1",
    "description": "The built-in local guest account is another well-known name to attackers. It is\nrecommended to rename this account to something that does not indicate its purpose.\nEven if you disable this account, which is recommended, ensure that you rename it for\nadded security.",
    "rationale": "The Guest account exists on all computers that run the Windows 2000 or newer\noperating systems. If you rename this account, it is slightly more difficult for\nunauthorized persons to guess this privileged user name and password combination.",
    "impact": "There should be little impact, because the Guest account is disabled by default.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, configure the following UI path:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Accounts: Rename guest account",
    "default_value": "Guest.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/accounts-rename-guest-account\n2. GRID: MS-00000057\nPage 154\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.7 Manage Default Accounts on Enterprise Assets and\nSoftware\nv8\nManage default accounts on enterprise assets and software, such as root,\n● ● ●\nadministrator, and other pre-configured vendor accounts. Example\nimplementations can include: disabling default accounts or making them\nunusable.\nPage 155",
    "page_number": 151
  },
  {
    "cis_id": "2.3.2.1",
    "title": "Ensure 'Audit: Force audit policy subcategory settings\n(Windows Vista or later) to override audit policy category settings'\nis set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting allows administrators to enable the more precise auditing capabilities\npresent in Windows Vista.\nThe Audit Policy settings available in Windows Server 2003 Active Directory do not yet\ncontain settings for managing the new auditing subcategories. To properly apply the\nauditing policies prescribed in this baseline, the Audit: Force audit policy subcategory\nsettings (Windows Vista or later) to override audit policy category settings setting needs\nto be configured to Enabled.\nThe recommended state for this setting is: Enabled.\nImportant: Be very cautious about audit settings that can generate a large volume of\ntraffic. For example, if you enable either success or failure auditing for all of the\nPrivilege Use subcategories, the high volume of audit events generated can make it\ndifficult to find other types of entries in the Security log. Such a configuration could also\nhave a significant impact on system performance.",
    "rationale": "Prior to the introduction of auditing subcategories in Windows Vista, it was difficult to\ntrack events at a per-system or per-user level. The larger event categories created too\nmany events and the key information that needed to be audited was difficult to find.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:SCENoApplyLegacyAuditPolicy\nPage 157",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Audit: Force audit policy subcategory settings\n(Windows Vista or later) to override audit policy category settings",
    "default_value": "Enabled. (Advanced Audit Policy Configuration settings will be used for auditing\nconfiguration, and legacy Audit Policy configuration settings will be ignored.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/audit-force-audit-policy-subcategory-settings-to-override\n2. https://learn.microsoft.com/en-us/windows-server/identity/ad-\nds/manage/component-updates/command-line-process-auditing#to-ensure-that-\nadvanced-audit-policy-configuration-settings-are-not-overwritten\n3. GRID: MS-00000058\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.5 Collect Detailed Audit Logs\nv8 Configure detailed audit logging for enterprise assets containing sensitive data. ● ●\nInclude event source, date, username, timestamp, source addresses, destination\naddresses, and other useful elements that could assist in a forensic investigation.\n6.2 Activate audit logging\nv7 ● ● ●\nEnsure that local logging has been enabled on all systems and networking\ndevices.\n6.3 Enable Detailed Logging\nv7 Enable system logging to include detailed information such as an event source, ● ●\ndate, user, timestamp, source addresses, destination addresses, and other useful\nelements.\nPage 158",
    "page_number": 158
  },
  {
    "cis_id": "2.3.2.2",
    "title": "Ensure 'Audit: Shut down system immediately if\nunable to log security audits' is set to 'Disabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the system shuts down if it is unable to log\nSecurity events. It is a requirement for Trusted Computer System Evaluation Criteria\n(TCSEC)-C2 and Common Criteria certification to prevent auditable events from\noccurring if the audit system is unable to log them. Microsoft has chosen to meet this\nrequirement by halting the system and displaying a stop message if the auditing system\nexperiences a failure. When this policy setting is enabled, the system will be shut down\nif a security audit cannot be logged for any reason.\nIf the Audit: Shut down system immediately if unable to log security audits setting is\nenabled, unplanned system failures can occur. The administrative burden can be\nsignificant, especially if you also configure the Retention method for the Security log to\nDo not overwrite events (clear log manually). This configuration causes a repudiation\nthreat (a backup operator could deny that they backed up or restored data) to become a\ndenial of service (DoS) vulnerability, because a server could be forced to shut down if it\nis overwhelmed with logon events and other security events that are written to the\nSecurity log. Also, because the shutdown is not graceful, it is possible that irreparable\ndamage to the operating system, applications, or data could result. Although the NTFS\nfile system guarantees its integrity when an ungraceful computer shutdown occurs, it\ncannot guarantee that every data file for every application will still be in a usable form\nwhen the computer restarts.\nThe recommended state for this setting is: Disabled.",
    "rationale": "If the computer is unable to record events to the Security log, critical evidence or\nimportant troubleshooting information may not be available for review after a security\nincident. Also, an attacker could potentially generate a large volume of Security log\nevents to purposely force a computer shutdown.",
    "impact": "None - this is the default behavior.\nPage 159",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 0.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:CrashOnAuditFail",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Audit: Shut down system immediately if unable to\nlog security audits",
    "default_value": "Disabled.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/audit-shut-down-system-immediately-if-unable-to-log-security-\naudits\n2. GRID: MS-00000059\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n8.3 Ensure Adequate Audit Log Storage\nv8 ● ● ●\nEnsure that logging destinations maintain adequate storage to comply with\nthe enterprise’s audit log management process.\n6.4 Ensure adequate storage for logs\nv7 ● ●\nEnsure that all systems that store logs have adequate storage space for the\nlogs generated.\n2.3.3 DCOM\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 160",
    "page_number": 160
  },
  {
    "cis_id": "2.3.4.1",
    "title": "Ensure 'Devices: Prevent users from installing printer\ndrivers' is set to 'Enabled'",
    "profile": "L2",
    "description": "For a computer to print to a shared printer, the driver for that shared printer must be\ninstalled on the local computer. This security setting determines who is allowed to install\na printer driver as part of connecting to a shared printer.\nThe recommended state for this setting is: Enabled.\nNote: This setting does not affect the ability to add a local printer. This setting does not\naffect Administrators.",
    "rationale": "It may be appropriate in some organizations to allow users to install printer drivers on\ntheir own workstations. However, in a high security environment, you should allow only\nAdministrators, not users, to do this, because printer driver installation may\nunintentionally cause the computer to become less stable. A malicious user could install\ninappropriate printer drivers in a deliberate attempt to damage the computer, or a user\nmight accidentally install malicious software that masquerades as a printer driver. It is\nfeasible for an attacker to disguise a Trojan horse program as a printer driver. The\nprogram may appear to users as if they must use it to print, but such a program could\nunleash malicious code on your computer network.",
    "impact": "Only Administrators will be able to install a printer driver as part of connecting to a\nshared printer. The ability to add a local printer will not be affected.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Providers\\LanMan Print\nServices\\Servers:AddPrinterDrivers\nPage 162",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Devices: Prevent users from installing printer\ndrivers",
    "default_value": "Disabled. (Any user can install a printer driver as part of connecting to a shared printer.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/devices-prevent-users-from-installing-printer-drivers\n2. GRID: MS-00000060\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n6.8 Define and Maintain Role-Based Access Control\nDefine and maintain role-based access control, through determining and\nv8 documenting the access rights necessary for each role within the enterprise to ●\nsuccessfully carry out its assigned duties. Perform access control reviews of\nenterprise assets to validate that all privileges are authorized, on a recurring\nschedule at a minimum annually, or more frequently.\n2.3.5 Domain controller\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\n2.3.6 Domain member\nThis section is intentionally blank and exists to ensure the structure of Windows\nbenchmarks is consistent.\nPage 163",
    "page_number": 163
  },
  {
    "cis_id": "2.3.7.1",
    "title": "Ensure 'Interactive logon: Do not require\nCTRL+ALT+DEL' is set to 'Disabled'",
    "profile": "L1",
    "description": "This policy setting determines whether users must press CTRL+ALT+DEL before they\nlog on.\nThe recommended state for this setting is: Disabled.",
    "rationale": "Microsoft developed this feature to make it easier for users with certain types of physical\nimpairments to log on to computers that run Windows. If users are not required to press\nCTRL+ALT+DEL, they are susceptible to attacks that attempt to intercept their\npasswords. If CTRL+ALT+DEL is required before logon, user passwords are\ncommunicated by means of a trusted path.\nAn attacker could install a Trojan horse program that looks like the standard Windows\nlogon dialog box and capture the user's password. The attacker would then be able to\nlog on to the compromised account with whatever level of privilege that user has.",
    "impact": "Users must press CTRL+ALT+DEL before they log on to Windows unless they use a\nsmart card for Windows logon. A smart card is a tamper-proof device that stores\nsecurity information.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of `0.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:DisableCAD",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nDisabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Do not require CTRL+ALT+DEL\nPage 165",
    "default_value": "On Windows 7 or older: Disabled.\nOn Windows 8.0 or newer: Enabled.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-do-not-require-ctrl-alt-del\n2. GRID: MS-00000071\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 166",
    "page_number": 166
  },
  {
    "cis_id": "2.3.7.2",
    "title": "Ensure 'Interactive logon: Don't display last signed-in'\nis set to 'Enabled'",
    "profile": "L1",
    "description": "This policy setting determines whether the account name of the last user to log on to the\nclient computers in your organization will be displayed in each computer's respective\nWindows logon screen. Enable this policy setting to prevent intruders from collecting\naccount names visually from the screens of desktop or laptop computers in your\norganization.\nThe recommended state for this setting is: Enabled.",
    "rationale": "An attacker with access to the console (for example, someone with physical access or\nsomeone who is able to connect to the server through Remote Desktop Services) could\nview the name of the last user who logged on to the server. The attacker could then try\nto guess the password, use a dictionary, or use a brute-force attack to try and log on.",
    "impact": "The name of the last user to successfully log on will not be displayed in the Windows\nlogon screen.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 1.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:DontDisplayLas\ntUserName",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to\nEnabled:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Don't display last signed-in\nNote: In older versions of Microsoft Windows, this setting was named Interactive logon:\nDo not display last user name, but it was renamed starting with Windows 10 Release\n1703.\nPage 167",
    "default_value": "Disabled. (The name of the last user to log on is displayed in the Windows logon\nscreen.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-do-not-display-last-user-name\n2. GRID: MS-00000072\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.1 Establish and Maintain a Secure Configuration Process\nEstablish and maintain a secure configuration process for enterprise assets\nv8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ●\nservers) and software (operating systems and applications). Review and update\ndocumentation annually, or when significant enterprise changes occur that could\nimpact this Safeguard.\n5.1 Establish Secure Configurations\nv7 ● ● ●\nMaintain documented, standard security configuration standards for all\nauthorized operating systems and software.\nPage 168",
    "page_number": 168
  },
  {
    "cis_id": "2.3.7.3",
    "title": "Ensure 'Interactive logon: Machine account lockout\nthreshold' is set to '10 or fewer invalid logon attempts, but not 0'",
    "profile": "BL",
    "description": "This security setting determines the number of failed logon attempts that causes the\nmachine to be locked out.\nFailed password attempts against workstations or member servers that have been\nlocked using either CTRL+ALT+DELETE or password protected screen savers counts\nas failed logon attempts.\nThe machine lockout policy is enforced only on those machines that have BitLocker\nenabled for protecting OS volumes. Please ensure that appropriate recovery password\nbackup policies are enabled.\nThe recommended state for this setting is: 10 or fewer invalid logon attempts,\nbut not 0.\nNote: A value of 0 does not conform to the benchmark as it disables the machine\naccount lockout threshold. Values from 1 to 3 will be interpreted as 4.",
    "rationale": "If a machine is lost or stolen, or if an insider threat attempts a brute force password\nattack against the computer, it is important to ensure that BitLocker will lock the\ncomputer and therefore prevent a successful attack.",
    "impact": "Users will be able to mistype their password several times, but the machine account will\nbe locked out if a brute force password attack occurs. A locked out machine can only be\nrecovered by providing the BitLocker recovery key at the console.\nPage 169",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value of 10 or less, but not 0.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:MaxDevicePassw\nordFailedAttempts",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 10 or\nfewer invalid logon attempts, but not 0:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Machine account lockout\nthreshold",
    "default_value": "0 invalid logon attempts. (The machine will never lock out.)\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-machine-account-lockout-threshold\n2. GRID: MS-00000073\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.10 Enforce Automatic Device Lockout on Portable End-\nUser Devices\nv8\nEnforce automatic device lockout following a predetermined threshold of local\n● ●\nfailed authentication attempts on portable end-user devices, where supported. For\nlaptops, do not allow more than 20 failed authentication attempts; for tablets and\nsmartphones, no more than 10 failed authentication attempts. Example\nimplementations include Microsoft® InTune Device Lock and Apple® Configuration\nProfile maxFailedAttempts.\nPage 170",
    "page_number": 170
  },
  {
    "cis_id": "2.3.7.4",
    "title": "Ensure 'Interactive logon: Machine inactivity limit' is\nset to '900 or fewer second(s), but not 0'",
    "profile": "L1",
    "description": "This policy setting specifies the text displayed in the title bar of the window that users\nsee when they log on to the system. Configure this setting in a manner that is consistent\nwith the security and operational requirements of your organization.",
    "rationale": "Displaying a warning message before logon may help prevent an attack by warning the\nattacker about the consequences of their misconduct before it happens. It may also help\nto reinforce corporate policy by notifying employees of the appropriate policy during the\nlogon process.",
    "impact": "Users will have to acknowledge a dialog box with the configured title before they can log\non to the computer.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_SZ value of text.\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System:LegalNoticeCap\ntion",
    "remediation_procedure": "To establish the recommended configuration via GP, configure the following UI path to a\nvalue that is consistent with the security and operational requirements of your\norganization:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Message title for users\nattempting to log on",
    "default_value": "No message.\nPage 175\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-message-title-for-users-attempting-to-log-on\n2. GRID: MS-00000076\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 176",
    "page_number": 172
  },
  {
    "cis_id": "2.3.7.7",
    "title": "Ensure 'Interactive logon: Prompt user to change\npassword before expiration' is set to 'between 5 and 14 days'",
    "profile": "L1",
    "description": "This policy setting determines how far in advance users are warned that their password\nwill expire. It is recommended that you configure this policy setting to at least 5 days but\nno more than 14 days to sufficiently warn users when their passwords will expire.\nThe recommended state for this setting is: between 5 and 14 days.",
    "rationale": "Users will need to be warned that their passwords are going to expire, or they may\ninadvertently be locked out of the computer when their passwords expire. This condition\ncould lead to confusion for users who access the network locally, or make it impossible\nfor users to access your organization's network through dial-up or virtual private network\n(VPN) connections.",
    "impact": "Users will see a dialog box prompt to change their password each time that they log on\nto the domain when their password is configured to expire between 5 and 14 days.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_DWORD value between 5 and 14.\nHKLM\\SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Winlogon:PasswordExpiryWarning",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to a value\nbetween 5 and 14 days:\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Prompt user to change password\nbefore expiration",
    "default_value": "5 days.\nPage 177\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-prompt-user-to-change-password-before-\nexpiration\n2. GRID: MS-00000078\nCIS Controls:\nControls Version Control IG 1 IG 2 IG 3\n0.0 Explicitly Not Mapped\nv8\nExplicitly Not Mapped\n0.0 Explicitly Not Mapped\nv7\nExplicitly Not Mapped\nPage 178",
    "page_number": 178
  },
  {
    "cis_id": "2.3.7.8",
    "title": "Ensure 'Interactive logon: Smart card removal\nbehavior' is set to 'Lock Workstation' or higher",
    "profile": "L1",
    "description": "This policy setting determines what happens when the smart card for a logged-on user\nis removed from the smart card reader.\nThe recommended state for this setting is: Lock Workstation. Configuring this setting\nto Force Logoff or Disconnect if a Remote Desktop Services session also\nconforms to the benchmark.",
    "rationale": "Users sometimes forget to lock their workstations when they are away from them,\nallowing the possibility for malicious users to access their computers. If smart cards are\nused for authentication, the computer should automatically lock itself when the card is\nremoved to ensure that only the user with the smart card is accessing resources using\nthose credentials.",
    "impact": "If you select Lock Workstation, the workstation is locked when the smart card is\nremoved, allowing users to leave the area, take their smart card with them, and still\nmaintain a protected session.\nIf you select Force Logoff, users are automatically logged off when their smart card is\nremoved.\nIf you select Disconnect if a Remote Desktop Services session, removal of the\nsmart card disconnects the session without logging the users off. This allows the user to\ninsert the smart card and resume the session later, or at another smart card reader-\nequipped computer, without having to log on again. If the session is local, this policy will\nfunction identically to Lock Workstation.\nEnforcing this setting on computers used by people who must log onto multiple\ncomputers in order to perform their duties could be frustrating and lower productivity.\nFor example, if network administrators are limited to a single account but need to log\ninto several computers simultaneously in order to effectively manage the network\nenforcing this setting will limit them to logging onto one computer at a time. For these\nreasons it is recommended that this setting only be enforced on workstations used for\npurposes commonly associated with typical users such as document creation and\nemail.\nPage 179",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed. This group policy setting is backed by the following registry location with a\nREG_SZ value of 1, 2 or 3.\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon:ScRemoveOption",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Lock\nWorkstation (or, if applicable for your environment, Force Logoff or Disconnect if\na Remote Desktop Services session):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Local\nPolicies\\Security Options\\Interactive logon: Smart card removal behavior",
    "default_value": "No action.\nReferences:\n1. https://learn.microsoft.com/en-us/windows/security/threat-protection/security-\npolicy-settings/interactive-logon-smart-card-removal-behavior\n2. GRID: MS-00000080\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.3 Configure Automatic Session Locking on Enterprise\nAssets\nv8 ● ● ●\nConfigure automatic session locking on enterprise assets after a defined period\nof inactivity. For general purpose operating systems, the period must not exceed\n15 minutes. For mobile end-user devices, the period must not exceed 2 minutes.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\nPage 180",
    "page_number": 180
  }
]