[
  {
    "cis_id": "1.2.4",
    "title": "Ensure 'Reset account lockout counter after' is set to\n'15 or more minute(s)'",
    "profile": "L1",
    "description": "This policy setting determines the length of time before the Account lockout threshold\nresets to zero. The default value for this policy setting is Not Defined. If the Account\nlockout threshold is defined, this reset time must be less than or equal to the value for\nthe Account lockout duration setting.\nIf you leave this policy setting at its default value or configure the value to an interval\nthat is too long, your environment could be vulnerable to a DoS attack. An attacker\ncould maliciously perform a number of failed logon attempts on all users in the\norganization, which will lock out their accounts. If no policy were determined to reset the\naccount lockout, it would be a manual task for administrators. Conversely, if a\nreasonable time value is configured for this policy setting, users would be locked out for\na set period until all of the accounts are unlocked automatically.\nThe recommended state for this setting is: 15 or more minute(s).\nNote: Password Policy settings (section 1.1) and Account Lockout Policy settings\n(section 1.2) must be applied via the Default Domain Policy GPO in order to be\nglobally in effect on domain user accounts as their default behavior. If these settings\nare configured in another GPO, they will only affect local user accounts on the\ncomputers that receive the GPO. However, custom exceptions to the default password\npolicy and account lockout policy rules for specific domain users and/or groups can be\ndefined using Password Settings Objects (PSOs), which are completely separate from\nGroup Policy and most easily configured using Active Directory Administrative Center.",
    "rationale": "Users can accidentally lock themselves out of their accounts if they mistype their\npassword multiple times. To reduce the chance of such accidental lockouts, the Reset\naccount lockout counter after setting determines the number of minutes that must\nelapse before the counter that tracks failed logon attempts and triggers lockouts is reset\nto 0.\nPage 63",
    "impact": "If you do not configure this policy setting or if the value is configured to an interval that is\ntoo long, a DoS attack could occur. An attacker could maliciously attempt to log on to\neach user's account numerous times and lock out their accounts as described in the\npreceding paragraphs. If you do not configure the Reset account lockout counter after\nsetting, administrators would have to manually unlock all accounts. If you configure this\npolicy setting to a reasonable value the users would be locked out for some period, after\nwhich their accounts would unlock automatically. Be sure that you notify users of the\nvalues used for this policy setting so that they will wait for the lockout timer to expire\nbefore they call the help desk about their inability to log on.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as\nprescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 15 or\nmore minute(s):\nComputer Configuration\\Policies\\Windows Settings\\Security Settings\\Account\nPolicies\\Account Lockout Policy\\Reset account lockout counter after",
    "default_value": "None, because this policy setting only has meaning when an Account lockout threshold\nis specified. When an Account lockout threshold is configured, Windows automatically\nsuggests a value of 30 minutes.\nReferences:\n1. https://www.cisecurity.org/white-papers/cis-password-policy-guide/\n2. GRID: MS-00000011\nPage 64\nCIS Controls:\nControls\nControl IG 1 IG 2 IG 3\nVersion\n4.10 Enforce Automatic Device Lockout on Portable End-\nUser Devices\nv8\nEnforce automatic device lockout following a predetermined threshold of local\n● ●\nfailed authentication attempts on portable end-user devices, where supported. For\nlaptops, do not allow more than 20 failed authentication attempts; for tablets and\nsmartphones, no more than 10 failed authentication attempts. Example\nimplementations include Microsoft® InTune Device Lock and Apple® Configuration\nProfile maxFailedAttempts.\n16.2 Configure Centralized Point of Authentication\nv7 ● ●\nConfigure access for all accounts through as few centralized points of\nauthentication as possible, including network, security, and cloud systems.\n16.11 Lock Workstation Sessions After Inactivity\nv7 ● ● ●\nAutomatically lock workstation sessions after a standard period of inactivity.\nPage 65",
    "page_number": 64
  }
]