[
  {
    "cis_id": "9.2.1",
    "title": "Ensure 'Windows Firewall: Private: Firewall state' is set\nto 'On (recommended)'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Select On (recommended) to have Windows Firewall with Advanced Security use the settings for this profile to filter network traffic. If you select Off, Windows Firewall with Advanced Security will not use any of the firewall rules or connection security rules for this profile. The recommended state for this setting is: On (recommended).",
    "rationale": "If the firewall is turned off all traffic will be able to access the system and an attacker may be more easily able to remotely exploit a weakness in a network service.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile:EnableFirewal l",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to On (recommended): Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Firewall state",
    "default_value": "On (recommended). (The Windows Firewall with Advanced Security will be active in this profile.) Page 367",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 368
  },
  {
    "cis_id": "9.2.2",
    "title": "Ensure 'Windows Firewall: Private: Inbound\nconnections' is set to 'Block (default)'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "This setting determines the behavior for inbound connections that do not match an inbound firewall rule. The recommended state for this setting is: Block (default).",
    "rationale": "If the firewall allows all traffic to access the system then an attacker may be more easily able to remotely exploit a weakness in a network service.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile:DefaultInboun dAction",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Block (default): Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Inbound connections",
    "default_value": "Block (default). (The Windows Firewall with Advanced Security will block all inbound connections that do not match an inbound firewall rule in this profile.) Page 369",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 370
  },
  {
    "cis_id": "9.2.3",
    "title": "Ensure 'Windows Firewall: Private: Settings: Display a\nnotification' is set to 'No'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Select this option to have Windows Firewall with Advanced Security display notifications to the user when a program is blocked from receiving inbound connections. The recommended state for this setting is: No. Note: When the Apply local firewall rules setting is configured to No, it's recommended to also configure the Display a notification setting to No. Otherwise, users will continue to receive messages that ask if they want to unblock a restricted inbound connection, but the user's response will be ignored.",
    "rationale": "Firewall notifications can be complex and may confuse the end users, who would not be able to address the alert.",
    "impact": "Windows Firewall will not display a notification when a program is blocked from receiving inbound connections.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile:DisableNotifi cations",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Settings Customize\\Display a notification",
    "default_value": "Yes. (Windows Firewall with Advanced Security will display a notification when a program is blocked from receiving inbound connections.) Page 371",
    "references": [],
    "additional_info": "",
    "page_number": 372
  },
  {
    "cis_id": "9.2.4",
    "title": "Ensure 'Windows Firewall: Private: Logging: Name' is\nset to '%SystemRoot%\\System32\\logfiles\\firewall\\privatefw.log'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to specify the path and name of the file in which Windows Firewall will write its log information. The recommended state for this setting is: %SystemRoot%\\System32\\logfiles\\firewall\\privatefw.log.",
    "rationale": "If Windows Firewall events are not recorded it may be difficult or impossible for Administrators to analyze system issues or unauthorized activities of malicious users. Microsoft stores all firewall events as one file on the system (pfirewall.log). To improve logging, separate each firewall profile (domain, private, public) into its own distinct log file (domainfw.log, privatefw.log, publicfw.log) for better organization and identification of specific issues within each profile.",
    "impact": "The log file will be stored in the specified file.",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 374
  },
  {
    "cis_id": "9.2.5",
    "title": "Ensure 'Windows Firewall: Private: Logging: Size limit\n(KB)' is set to '16,384 KB or greater'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to specify the size limit of the file in which Windows Firewall will write its log information. The recommended state for this setting is: 16,384 KB or greater.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "The log file size will be limited to the specified size, old events will be overwritten by newer ones when the limit is reached.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 16384. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging:LogFi leSize",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 16,384 KB or greater: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Logging Customize\\Size limit (KB)",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 376
  },
  {
    "cis_id": "9.2.6",
    "title": "Ensure 'Windows Firewall: Private: Logging: Log\ndropped packets' is set to 'Yes'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to log when Windows Firewall with Advanced Security discards an inbound packet for any reason. The log records why and when the packet was dropped. Look for entries with the word DROP in the action column of the log. The recommended state for this setting is: Yes.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "Information about dropped packets will be recorded in the firewall log file.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging:LogDr oppedPackets",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Yes: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Logging Customize\\Log dropped packets",
    "default_value": "No (default). (Information about dropped packets will not be recorded in the firewall log file.) Page 377",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 378
  },
  {
    "cis_id": "9.2.7",
    "title": "Ensure 'Windows Firewall: Private: Logging: Log\nsuccessful connections' is set to 'Yes'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to log when Windows Firewall with Advanced Security allows an inbound connection. The log records why and when the connection was formed. Look for entries with the word ALLOW in the action column of the log. The recommended state for this setting is: Yes.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "Information about successful connections will be recorded in the firewall log file.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PrivateProfile\\Logging:LogSu ccessfulConnections",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Yes: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Private Profile\\Logging Customize\\Log successful connections",
    "default_value": "No (default). (Information about successful connections will not be recorded in the firewall log file.) Page 379",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 380
  },
  {
    "cis_id": "9.3.1",
    "title": "Ensure 'Windows Firewall: Public: Firewall state' is set\nto 'On (recommended)'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Select On (recommended) to have Windows Firewall with Advanced Security use the settings for this profile to filter network traffic. If you select Off, Windows Firewall with Advanced Security will not use any of the firewall rules or connection security rules for this profile. The recommended state for this setting is: On (recommended).",
    "rationale": "If the firewall is turned off all traffic will be able to access the system and an attacker may be more easily able to remotely exploit a weakness in a network service.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile:EnableFirewall",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to On (recommended): Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Firewall state",
    "default_value": "On (recommended). (The Windows Firewall with Advanced Security will be active in this profile.) Page 382",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 383
  },
  {
    "cis_id": "9.3.2",
    "title": "Ensure 'Windows Firewall: Public: Inbound connections'\nis set to 'Block (default)'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "This setting determines the behavior for inbound connections that do not match an inbound firewall rule. The recommended state for this setting is: Block (default).",
    "rationale": "If the firewall allows all traffic to access the system then an attacker may be more easily able to remotely exploit a weakness in a network service.",
    "impact": "None - this is the default behavior.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile:DefaultInbound Action",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Block (default): Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Inbound connections",
    "default_value": "Block (default). (The Windows Firewall with Advanced Security will block all inbound connections that do not match an inbound firewall rule in this profile.) Page 384",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-"
    ],
    "additional_info": "",
    "page_number": 385
  },
  {
    "cis_id": "9.3.3",
    "title": "Ensure 'Windows Firewall: Public: Settings: Display a\nnotification' is set to 'No'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Select this option to have Windows Firewall with Advanced Security display notifications to the user when a program is blocked from receiving inbound connections. The recommended state for this setting is: No.",
    "rationale": "Some organizations may prefer to avoid alarming users when firewall rules block certain types of network activity. However, notifications can be helpful when troubleshooting network issues involving the firewall.",
    "impact": "Windows Firewall will not display a notification when a program is blocked from receiving inbound connections.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile:DisableNotific ations",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 'No': Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Settings Customize\\Display a notification",
    "default_value": "Yes. (Windows Firewall with Advanced Security will display a notification when a program is blocked from receiving inbound connections.) Page 386",
    "references": [],
    "additional_info": "",
    "page_number": 387
  },
  {
    "cis_id": "9.3.4",
    "title": "Ensure 'Windows Firewall: Public: Settings: Apply local\nfirewall rules' is set to 'No'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "This setting controls whether local administrators are allowed to create local firewall rules that apply together with firewall rules configured by Group Policy. The recommended state for this setting is: No. Note: When the Apply local firewall rules setting is configured to No, it's recommended to also configure the Display a notification setting to No. Otherwise, users will continue to receive messages that ask if they want to unblock a restricted inbound connection, but the user's response will be ignored.",
    "rationale": "When in the Public profile, there should be no special local firewall exceptions per computer. These settings should be managed by a centralized policy.",
    "impact": "Administrators can still create firewall rules, but the rules will not be applied.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 0. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile:AllowLocalPoli cyMerge",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Settings Customize\\Apply local firewall rules",
    "default_value": "Yes (default). (Firewall rules created by administrators will be applied.) Page 388",
    "references": [],
    "additional_info": "",
    "page_number": 389
  },
  {
    "cis_id": "9.3.5",
    "title": "Ensure 'Windows Firewall: Public: Settings: Apply local\nconnection security rules' is set to 'No'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "This setting controls whether local administrators are allowed to create connection security rules that apply together with connection security rules configured by Group Policy. The recommended state for this setting is: No.",
    "rationale": "Users with administrative privileges might create firewall rules that expose the system to remote attack.",
    "impact": "Administrators can still create local connection security rules, but the rules will not be applied.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 0. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile:AllowLocalIPse cPolicyMerge",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to No: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Settings Customize\\Apply local connection security rules",
    "default_value": "Yes (default). (Local connection security rules created by administrators will be applied.)",
    "references": [],
    "additional_info": "",
    "page_number": 391
  },
  {
    "cis_id": "9.3.6",
    "title": "Ensure 'Windows Firewall: Public: Logging: Name' is\nset to '%SystemRoot%\\System32\\logfiles\\firewall\\publicfw.log'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to specify the path and name of the file in which Windows Firewall will write its log information. The recommended state for this setting is: %SystemRoot%\\System32\\logfiles\\firewall\\publicfw.log.",
    "rationale": "If Windows Firewall events are not recorded it may be difficult or impossible for Administrators to analyze system issues or unauthorized activities of malicious users. Microsoft stores all firewall events as one file on the system (pfirewall.log). To improve logging, separate each firewall profile (domain, private, public) into its own distinct log file (domainfw.log, privatefw.log, publicfw.log) for better organization and identification of specific issues within each profile.",
    "impact": "The log file will be stored in the specified file.",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 393
  },
  {
    "cis_id": "9.3.7",
    "title": "Ensure 'Windows Firewall: Public: Logging: Size limit\n(KB)' is set to '16,384 KB or greater'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to specify the size limit of the file in which Windows Firewall will write its log information. The recommended state for this setting is: 16,384 KB or greater.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "The log file size will be limited to the specified size, old events will be overwritten by newer ones when the limit is reached.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 16384. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging:LogFil eSize",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 16,384 KB or greater: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Logging Customize\\Size limit (KB)",
    "default_value": "4,096 KB.",
    "references": [],
    "additional_info": "",
    "page_number": 395
  },
  {
    "cis_id": "9.3.8",
    "title": "Ensure 'Windows Firewall: Public: Logging: Log\ndropped packets' is set to 'Yes'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to log when Windows Firewall with Advanced Security discards an inbound packet for any reason. The log records why and when the packet was dropped. Look for entries with the word DROP in the action column of the log. The recommended state for this setting is: Yes.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "Information about dropped packets will be recorded in the firewall log file.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging:LogDro ppedPackets",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Yes: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Logging Customize\\Log dropped packets",
    "default_value": "No (default). (Information about dropped packets will not be recorded in the firewall log file.)",
    "references": [],
    "additional_info": "",
    "page_number": 397
  },
  {
    "cis_id": "9.3.9",
    "title": "Ensure 'Windows Firewall: Public: Logging: Log\nsuccessful connections' is set to 'Yes'",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "Use this option to log when Windows Firewall with Advanced Security allows an inbound connection. The log records why and when the connection was formed. Look for entries with the word ALLOW in the action column of the log. The recommended state for this setting is: Yes.",
    "rationale": "If events are not recorded it may be difficult or impossible to determine the root cause of system problems or the unauthorized activities of malicious users.",
    "impact": "Information about successful connections will be recorded in the firewall log file.",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 1. HKLM\\SOFTWARE\\Policies\\Microsoft\\WindowsFirewall\\PublicProfile\\Logging:LogSuc cessfulConnections",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Yes. Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall with Advanced Security\\Windows Defender Firewall Properties\\Public Profile\\Logging Customize\\Log successful connections",
    "default_value": "No (default). (Information about successful connections will not be recorded in the firewall log file.)",
    "references": [],
    "additional_info": "",
    "page_number": 399
  }
]