[
  {
    "cis_id": "6.8",
    "title": "Define and Maintain Role-Based Access Control Define and maintain role-based access control, through determining and v8 documenting the access rights necessary for each role within the enterprise to ● successfully carry out its assigned duties. Perform access control reviews of enterprise assets to validate that all privileges are authorized, on a recurring schedule at a minimum annually, or more frequently.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 69
  },
  {
    "cis_id": "6.2",
    "title": "Ensure that local logging has been enabled on all systems and networking",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "v7 ● ● ● Ensure that local logging has been enabled on all systems and networking devices. Page 114",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 115
  },
  {
    "cis_id": "6.3",
    "title": "Enable Detailed Logging",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "Force audit policy subcategory settings (Windows Vista or later) to override audit policy category settings",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Enabled: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\",
    "default_value": "Enabled. (Advanced Audit Policy Configuration settings will be used for auditing configuration, and legacy Audit Policy configuration settings will be ignored.)",
    "references": [
      "GRID: MS-00000058",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 159
  },
  {
    "cis_id": "6.4",
    "title": "Ensure adequate storage for logs",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed. This group policy setting is backed by the following registry location with a REG_DWORD value of 0. HKLM\\SYSTEM\\CurrentControlSet\\Control\\Lsa:CrashOnAuditFail Remediation: To establish the recommended configuration via GP, set the following UI path to Disabled: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Disabled: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\",
    "default_value": "Disabled.",
    "references": [
      "https://learn.microsoft.com/en-us/windows/security/threat-protection/security-"
    ],
    "additional_info": "",
    "page_number": 161
  },
  {
    "cis_id": "6.1",
    "title": "Utilize Three Synchronized Time Sources",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "Disabled. (The local computer clock does not synchronize time with NTP servers.)",
    "references": [
      "GRID: MS-00000367",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 777
  }
]