[
  {
    "cis_id": "4.4",
    "title": "Use Unique Passwords v7 Where multi-factor authentication is not supported (such as local administrator, ● ● root, or service accounts), accounts will use passwords that are unique to that system.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 49
  },
  {
    "cis_id": "4.10",
    "title": "Enforce Automatic Device Lockout on Portable End- User Devices v8 Enforce automatic device lockout following a predetermined threshold of local ● ● failed authentication attempts on portable end-user devices, where supported. For laptops, do not allow more than 20 failed authentication attempts; for tablets and smartphones, no more than 10 failed authentication attempts. Example implementations include Microsoft® InTune Device Lock and Apple® Configuration Profile maxFailedAttempts.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "Navigate to the UI Path articulated in the Remediation section and confirm it is set as prescribed.",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to 15 or more minute(s): Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\\Account lockout duration",
    "default_value": "None, because this policy setting only has meaning when an Account lockout threshold is specified. When an Account lockout threshold is configured, Windows automatically suggests a value of 30 minutes.",
    "references": [
      "https://www.cisecurity.org/white-papers/cis-password-policy-guide/",
      "GRID: MS-00000008",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 59
  },
  {
    "cis_id": "4.8",
    "title": "Log and Alert on Changes to Administrative Group",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [],
    "additional_info": "",
    "page_number": 69
  },
  {
    "cis_id": "4.3",
    "title": "Ensure the Use of Dedicated Administrative Accounts",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Administrators, Remote Desktop Users: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Local Policies\\User Rights Assignment\\Allow log on through Remote Desktop Services",
    "default_value": "Administrators, Remote Desktop Users.",
    "references": [
      "GRID: MS-00000018",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 80
  },
  {
    "cis_id": "4.7",
    "title": "Manage Default Accounts on Enterprise Assets and Software v8 ● ● ● Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Disabled: Computer Configuration\\Policies\\Windows Settings\\Security Settings\\Local Policies\\Security Options\\Accounts: Guest account status",
    "default_value": "Disabled.",
    "references": [
      "GRID: MS-00000054",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 150
  },
  {
    "cis_id": "4.1",
    "title": "Establish and Maintain a Secure Configuration Process Establish and maintain a secure configuration process for enterprise assets v8 (end-user devices, including portable and mobile, non-computing/IoT devices, and ● ● ● servers) and software (operating systems and applications). Review and update documentation annually, or when significant enterprise changes occur that could",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "Disabled. (The name of the last user to log on is displayed in the Windows logon screen.)",
    "references": [
      "GRID: MS-00000072",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 169
  },
  {
    "cis_id": "4.5",
    "title": "Implement and Manage a Firewall on End-User Devices v8 ● ● ● Implement and manage a host-based firewall or port-filtering tool on end-user devices, with a default-deny rule that drops all traffic except those services and ports that are explicitly allowed.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "",
    "default_value": "",
    "references": [
      "GRID: MS-00000180",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 369
  },
  {
    "cis_id": "4.2",
    "title": "Establish and Maintain a Secure Configuration Process for Network Infrastructure v8 ● ● ● Establish and maintain a secure configuration process for network devices. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
    "profile": "L1",
    "assessment_status": "Automated",
    "description": "",
    "rationale": "",
    "impact": "",
    "audit_procedure": "",
    "remediation_procedure": "To establish the recommended configuration via GP, set the following UI path to Enabled: Computer Configuration\\Policies\\Administrative Templates\\MSS (Legacy)\\MSS: (NoNameReleaseOnDemand) Allow the computer to ignore NetBIOS name release requests except from WINS servers Note: This Group Policy path does not exist by default. An additional Group Policy template (MSS-legacy.admx/adml) is required - it is available from this TechNet blog post: The MSS settings – Microsoft Security Guidance blog",
    "default_value": "Enabled.",
    "references": [
      "GRID: MS-00000255",
      "Control IG 1 IG 2 IG 3"
    ],
    "additional_info": "",
    "page_number": 514
  }
]